seradya/Lab1_Asm/Lab1_HelloWorld/Core/Asm/stm32l1xx.s
.equ	HSEStartUp_TimeOut,	0x0500		@ Time out for HSE start up

.equ	HSI_Value,	8000000				@ Value of the Internal oscillator in Hz

.equ	__MPU_PRESENT,	0				@ STM32 does not provide an MPU
.equ	__NVIC_PRIO_BITS,	4			@ STM32 uses 4 Bits for the Priority Levels
.equ	__Vendor_SysTickConfig,	0		@ Set to 1 if different SysTick Config is used



.equ	SRAM_BB_BASE,	0x22000000		@ SRAM base address in the alias region
.equ	PERIPH_BB_BASE,	0x42000000		@ Peripheral base address in the alias region

.equ	SRAM_BASE,		0x20000000		@ SRAM base address in the bit-band region
.equ	PERIPH_BASE,	0x40000000		@ Peripheral base address in the bit-band region

.equ	FSMC_R_BASE,	0xA0000000		@ FSMC registers base address

@ Peripheral memory map
.equ	APB1PERIPH_BASE,	PERIPH_BASE
.equ	APB2PERIPH_BASE,	PERIPH_BASE + 0x10000
.equ	AHBPERIPH_BASE,	PERIPH_BASE + 0x20000

.equ	TIM2_BASE,	    APB1PERIPH_BASE + 0x0000
.equ	TIM3_BASE,	    APB1PERIPH_BASE + 0x0400
.equ	TIM4_BASE,	    APB1PERIPH_BASE + 0x0800
.equ	TIM5_BASE,	    APB1PERIPH_BASE + 0x0C00
.equ	TIM6_BASE,	    APB1PERIPH_BASE + 0x1000
.equ	TIM7_BASE,	    APB1PERIPH_BASE + 0x1400
.equ    LCD_BASE,       APB1PERIPH_BASE + 0x2400
.equ	RTC_BASE,	    APB1PERIPH_BASE + 0x2800
.equ	WWDG_BASE,	    APB1PERIPH_BASE + 0x2C00
.equ	IWDG_BASE,	    APB1PERIPH_BASE + 0x3000
.equ	SPI2_BASE,	    APB1PERIPH_BASE + 0x3800
.equ	SPI3_BASE,	    APB1PERIPH_BASE + 0x3C00
.equ	USART2_BASE,	APB1PERIPH_BASE + 0x4400
.equ	USART3_BASE,	APB1PERIPH_BASE + 0x4800
.equ	USART4_BASE,	APB1PERIPH_BASE + 0x4C00
.equ	USART5_BASE,	APB1PERIPH_BASE + 0x5000
.equ	I2C1_BASE,	    APB1PERIPH_BASE + 0x5400
.equ	I2C2_BASE,	    APB1PERIPH_BASE + 0x5800
.equ    USB_FS_BASE,    APB1PERIPH_BASE + 0x5C00
.equ    USB_SRAM_BASE,  APB1PERIPH_BASE + 0x6000
.equ	PWR_BASE,	    APB1PERIPH_BASE + 0x7000
.equ	DAC_BASE,	    APB1PERIPH_BASE + 0x7400
.equ    OPAMP_BASE,     APB1PERIPH_BASE + 0x7C5C
.equ    RI_BASE,        APB1PERIPH_BASE + 0x7C04
.equ    COMP_BASE,      APB1PERIPH_BASE + 0x7C00

.equ	SYSCFG_BASE,	APB2PERIPH_BASE + 0x0000
.equ	EXTI_BASE,	    APB2PERIPH_BASE + 0x0400
.equ    TIM9_BASE,      APB2PERIPH_BASE + 0x0800
.equ    TIM10_BASE,     APB2PERIPH_BASE + 0x0C00
.equ    TIM11_BASE,     APB2PERIPH_BASE + 0x1000
.equ	ADC_BASE,	    APB2PERIPH_BASE + 0x2400
.equ    SDIO,           APB2PERIPH_BASE + 0x2C00
.equ	SPI1_BASE,	    APB2PERIPH_BASE + 0x3000
.equ	USART1_BASE,	APB2PERIPH_BASE + 0x3800

.equ    GPIOA_BASE,         AHBPERIPH_BASE
.equ    GPIOB_BASE,         AHBPERIPH_BASE + 0x0400
.equ    GPIOC_BASE,         AHBPERIPH_BASE + 0x0800
.equ    GPIOD_BASE,         AHBPERIPH_BASE + 0x0C00
.equ    GPIOE_BASE,         AHBPERIPH_BASE + 0x1000
.equ    GPIOH_BASE,         AHBPERIPH_BASE + 0x1400
.equ    GPIOF_BASE,         AHBPERIPH_BASE + 0x1800
.equ    GPIOG_BASE,         AHBPERIPH_BASE + 0x1C00
.equ	CRC_BASE,			AHBPERIPH_BASE + 0x3000
.equ	RCC_BASE,			AHBPERIPH_BASE + 0x3800
.equ    FLASH_BASE,         AHBPERIPH_BASE + 0x3C00

.equ	DMA1_BASE,			AHBPERIPH_BASE + 0x6000
.equ	DMA1_Channel1_BASE,	DMA1_BASE + 0x0008
.equ	DMA1_Channel2_BASE,	DMA1_BASE + 0x001C
.equ	DMA1_Channel3_BASE,	DMA1_BASE + 0x0030
.equ	DMA1_Channel4_BASE,	DMA1_BASE + 0x0044
.equ	DMA1_Channel5_BASE,	DMA1_BASE + 0x0058
.equ	DMA1_Channel6_BASE,	DMA1_BASE + 0x006C
.equ	DMA1_Channel7_BASE,	DMA1_BASE + 0x0080

.equ	DMA2_BASE,			AHBPERIPH_BASE + 0x6400
.equ	DMA2_Channel1_BASE,	DMA2_BASE + 0x0008
.equ	DMA2_Channel2_BASE,	DMA2_BASE + 0x001C
.equ	DMA2_Channel3_BASE,	DMA2_BASE + 0x0030
.equ	DMA2_Channel4_BASE,	DMA2_BASE + 0x0044
.equ	DMA2_Channel5_BASE,	DMA2_BASE + 0x0058
.equ	DMA2_Channel6_BASE,	DMA2_BASE + 0x006C
.equ	DMA2_Channel7_BASE,	DMA2_BASE + 0x0080




.equ	FLASH_R_BASE,	AHBPERIPH_BASE + 0x3C00 @ Flash registers base address
.equ	OB_BASE,	0x1FF80000 @ Flash Option Bytes base address

.equ	FSMC_Bank1_R_BASE,	FSMC_R_BASE + 0x0000 @ FSMC Bank1 registers base address
.equ	FSMC_Bank2_R_BASE,	FSMC_R_BASE + 0x0008 @ FSMC Bank2 registers base address
.equ	FSMC_Bank3_R_BASE,	FSMC_R_BASE + 0x0010 @ FSMC Bank3 registers base address
.equ	FSMC_Bank4_R_BASE,	FSMC_R_BASE + 0x0018 @ FSMC Bank4 registers base address

.equ	DBGMCU_BASE,	0xE0042000 @ Debug MCU registers base address


.equ	TIM2,	TIM2_BASE
.equ	TIM3,	TIM3_BASE
.equ	TIM4,	TIM4_BASE
.equ	TIM5,	TIM5_BASE
.equ	TIM6,	TIM6_BASE
.equ	TIM7,	TIM7_BASE
.equ	RTC,	RTC_BASE
.equ	WWDG,	WWDG_BASE
.equ	IWDG,	IWDG_BASE
.equ	SPI2,	SPI2_BASE
.equ	SPI3,	SPI3_BASE
.equ	USART2,	USART2_BASE
.equ	USART3,	USART3_BASE
.equ	USART4,	USART4_BASE
.equ	USART5,	USART5_BASE
.equ	I2C1,	I2C1_BASE
.equ	I2C2,	I2C2_BASE
.equ	PWR,	PWR_BASE
.equ	DAC,	DAC_BASE
.equ	EXTI,	EXTI_BASE
.equ	GPIOA,	GPIOA_BASE
.equ	GPIOB,	GPIOB_BASE
.equ	GPIOC,	GPIOC_BASE
.equ	GPIOD,	GPIOD_BASE
.equ	GPIOE,	GPIOE_BASE
.equ	GPIOF,	GPIOF_BASE
.equ	GPIOG,	GPIOG_BASE
.equ	SPI1,	SPI1_BASE
.equ	TIM9,	TIM9_BASE
.equ	TIM10,	TIM10_BASE
.equ	TIM11,	TIM11_BASE
.equ	USART1,	USART1_BASE
.equ	DMA1,	DMA1_BASE
.equ	DMA2,	DMA2_BASE
.equ	DMA1_Channel1,	DMA1_Channel1_BASE
.equ	DMA1_Channel2,	DMA1_Channel2_BASE
.equ	DMA1_Channel3,	DMA1_Channel3_BASE
.equ	DMA1_Channel4,	DMA1_Channel4_BASE
.equ	DMA1_Channel5,	DMA1_Channel5_BASE
.equ	DMA1_Channel6,	DMA1_Channel6_BASE
.equ	DMA1_Channel7,	DMA1_Channel7_BASE
.equ	DMA2_Channel1,	DMA2_Channel1_BASE
.equ	DMA2_Channel2,	DMA2_Channel2_BASE
.equ	DMA2_Channel3,	DMA2_Channel3_BASE
.equ	DMA2_Channel4,	DMA2_Channel4_BASE
.equ	DMA2_Channel5,	DMA2_Channel5_BASE
.equ	DMA2_Channel6,	DMA2_Channel6_BASE
.equ	DMA2_Channel7,	DMA2_Channel7_BASE
.equ	RCC,	RCC_BASE
.equ	CRC,	CRC_BASE
.equ	FLASH,	FLASH_R_BASE
.equ	OB,	OB_BASE
.equ	FSMC_Bank1,	FSMC_Bank1_R_BASE
.equ	FSMC_Bank2,	FSMC_Bank2_R_BASE
.equ	FSMC_Bank3,	FSMC_Bank3_R_BASE
.equ	FSMC_Bank4,	FSMC_Bank4_R_BASE
.equ	DBGMCU,	DBGMCU_BASE


.equ	PWR_CR,	0x40007000
.equ	PWR_CSR,	0x40007004
.equ	RCC_CR,	0x40021000
.equ	RCC_CFGR,	0x40021004
.equ	RCC_CIR,	0x40021008
.equ	RCC_APB2RSTR,	0x4002100C
.equ	RCC_APB1RSTR,	0x40021010
.equ	RCC_AHBENR,	RCC_BASE+0x1C
.equ	RCC_APB2ENR,	0x40021018
.equ	RCC_APB1ENR,	0x4002101C
.equ	RCC_BDCR,	0x40021020
.equ	RCC_CSR,	0x40021024

.equ    GPIOA_MODER,        GPIOA_BASE + 0x00
.equ    GPIOA_OTYPER,       GPIOA_BASE + 0x04
.equ    GPIOA_OSPEEDR,      GPIOA_BASE + 0x08
.equ    GPIOA_PUPDR,        GPIOA_BASE + 0x0C
.equ    GPIOA_IDR,          GPIOA_BASE + 0x10
.equ    GPIOA_ODR,          GPIOA_BASE + 0x14
.equ    GPIOA_BSRR,         GPIOA_BASE + 0x18
.equ    GPIOA_LCKR,         GPIOA_BASE + 0x1C
.equ    GPIOA_AFRL,         GPIOA_BASE + 0x20
.equ    GPIOA_AFRH,         GPIOA_BASE + 0x24
.equ    GPIOA_BRR,          GPIOA_BASE + 0x28

.equ    GPIOB_MODER,        GPIOB_BASE + 0x00
.equ    GPIOB_OTYPER,       GPIOB_BASE + 0x04
.equ    GPIOB_OSPEEDR,      GPIOB_BASE + 0x08
.equ    GPIOB_PUPDR,        GPIOB_BASE + 0x0C
.equ    GPIOB_IDR,          GPIOB_BASE + 0x10
.equ    GPIOB_ODR,          GPIOB_BASE + 0x14
.equ    GPIOB_BSRR,         GPIOB_BASE + 0x18
.equ    GPIOB_LCKR,         GPIOB_BASE + 0x1C
.equ    GPIOB_AFRL,         GPIOB_BASE + 0x20
.equ    GPIOB_AFRH,         GPIOB_BASE + 0x24
.equ    GPIOB_BRR,          GPIOB_BASE + 0x28

