seradya/Lab1_Asm/Lab1_HelloWorld/Core/Asm/stm32l1xx.s
@ Bit definition for RCC_CFGR register
@ SW configuration
.equ	RCC_CFGR_SW,	0x00000003	@ SW[1:0] bits (System clock Switch)
.equ	RCC_CFGR_SW_0,	0x00000001	@ Bit 0
.equ	RCC_CFGR_SW_1,	0x00000002	@ Bit 1

.equ	RCC_CFGR_SW_HSI,	0x00000000	@ HSI selected as system clock
.equ	RCC_CFGR_SW_HSE,	0x00000001	@ HSE selected as system clock
.equ	RCC_CFGR_SW_PLL,	0x00000002	@ PLL selected as system clock

@ SWS configuration
.equ	RCC_CFGR_SWS,	0x0000000C	@ SWS[1:0] bits (System Clock Switch Status)
.equ	RCC_CFGR_SWS_0,	0x00000004	@ Bit 0
.equ	RCC_CFGR_SWS_1,	0x00000008	@ Bit 1

.equ	RCC_CFGR_SWS_HSI,	0x00000000	@ HSI oscillator used as system clock
.equ	RCC_CFGR_SWS_HSE,	0x00000004	@ HSE oscillator used as system clock
.equ	RCC_CFGR_SWS_PLL,	0x00000008	@ PLL used as system clock

@ HPRE configuration
.equ	RCC_CFGR_HPRE,	0x000000F0	@ HPRE[3:0] bits (AHB prescaler)
.equ	RCC_CFGR_HPRE_0,	0x00000010	@ Bit 0
.equ	RCC_CFGR_HPRE_1,	0x00000020	@ Bit 1
.equ	RCC_CFGR_HPRE_2,	0x00000040	@ Bit 2
.equ	RCC_CFGR_HPRE_3,	0x00000080	@ Bit 3

.equ	RCC_CFGR_HPRE_DIV1,	0x00000000	@ SYSCLK not divided
.equ	RCC_CFGR_HPRE_DIV2,	0x00000080	@ SYSCLK divided by 2
.equ	RCC_CFGR_HPRE_DIV4,	0x00000090	@ SYSCLK divided by 4
.equ	RCC_CFGR_HPRE_DIV8,	0x000000A0	@ SYSCLK divided by 8
.equ	RCC_CFGR_HPRE_DIV16,	0x000000B0	@ SYSCLK divided by 16
.equ	RCC_CFGR_HPRE_DIV64,	0x000000C0	@ SYSCLK divided by 64
.equ	RCC_CFGR_HPRE_DIV128,	0x000000D0	@ SYSCLK divided by 128
.equ	RCC_CFGR_HPRE_DIV256,	0x000000E0	@ SYSCLK divided by 256
.equ	RCC_CFGR_HPRE_DIV512,	0x000000F0	@ SYSCLK divided by 512

@ PPRE1 configuration
.equ	RCC_CFGR_PPRE1,	0x00000700	@ PRE1[2:0] bits (APB1 prescaler)
.equ	RCC_CFGR_PPRE1_0,	0x00000100	@ Bit 0
.equ	RCC_CFGR_PPRE1_1,	0x00000200	@ Bit 1
.equ	RCC_CFGR_PPRE1_2,	0x00000400	@ Bit 2

.equ	RCC_CFGR_PPRE1_DIV1,	0x00000000	@ HCLK not divided
.equ	RCC_CFGR_PPRE1_DIV2,	0x00000400	@ HCLK divided by 2
.equ	RCC_CFGR_PPRE1_DIV4,	0x00000500	@ HCLK divided by 4
.equ	RCC_CFGR_PPRE1_DIV8,	0x00000600	@ HCLK divided by 8
.equ	RCC_CFGR_PPRE1_DIV16,	0x00000700	@ HCLK divided by 16

@ PPRE2 configuration
.equ	RCC_CFGR_PPRE2,	0x00003800	@ PRE2[2:0] bits (APB2 prescaler)
.equ	RCC_CFGR_PPRE2_0,	0x00000800	@ Bit 0
.equ	RCC_CFGR_PPRE2_1,	0x00001000	@ Bit 1
.equ	RCC_CFGR_PPRE2_2,	0x00002000	@ Bit 2

.equ	RCC_CFGR_PPRE2_DIV1,	0x00000000	@ HCLK not divided
.equ	RCC_CFGR_PPRE2_DIV2,	0x00002000	@ HCLK divided by 2
.equ	RCC_CFGR_PPRE2_DIV4,	0x00002800	@ HCLK divided by 4
.equ	RCC_CFGR_PPRE2_DIV8,	0x00003000	@ HCLK divided by 8
.equ	RCC_CFGR_PPRE2_DIV16,	0x00003800	@ HCLK divided by 16

@ ADCPPRE configuration
.equ	RCC_CFGR_ADCPRE,	0x0000C000	@ ADCPRE[1:0] bits (ADC prescaler)
.equ	RCC_CFGR_ADCPRE_0,	0x00004000	@ Bit 0
.equ	RCC_CFGR_ADCPRE_1,	0x00008000	@ Bit 1

.equ	RCC_CFGR_ADCPRE_DIV2,	0x00000000	@ PCLK2 divided by 2
.equ	RCC_CFGR_ADCPRE_DIV4,	0x00004000	@ PCLK2 divided by 4
.equ	RCC_CFGR_ADCPRE_DIV6,	0x00008000	@ PCLK2 divided by 6
.equ	RCC_CFGR_ADCPRE_DIV8,	0x0000C000	@ PCLK2 divided by 8

.equ	RCC_CFGR_PLLSRC,	0x00010000	@ PLL entry clock source

.equ	RCC_CFGR_PLLXTPRE,	0x00020000	@ HSE divider for PLL entry

@ PLLMUL configuration
.equ	RCC_CFGR_PLLMULL,	0x003C0000	@ PLLMUL[3:0] bits (PLL multiplication factor)
.equ	RCC_CFGR_PLLMULL_0,	0x00040000	@ Bit 0
.equ	RCC_CFGR_PLLMULL_1,	0x00080000	@ Bit 1
.equ	RCC_CFGR_PLLMULL_2,	0x00100000	@ Bit 2
.equ	RCC_CFGR_PLLMULL_3,	0x00200000	@ Bit 3

.ifdef STM32F10X_CL
.equ	RCC_CFGR_PLLSRC_HSI_Div2,	0x00000000	@ HSI clock divided by 2 selected as PLL entry clock source
.equ	RCC_CFGR_PLLSRC_PREDIV1,	0x00010000	@ PREDIV1 clock selected as PLL entry clock source

.equ	RCC_CFGR_PLLXTPRE_PREDIV1,	0x00000000	@ PREDIV1 clock not divided for PLL entry
.equ	RCC_CFGR_PLLXTPRE_PREDIV1_Div2,	0x00020000	@ PREDIV1 clock divided by 2 for PLL entry

.equ	RCC_CFGR_PLLMULL4,	0x00080000	@ PLL input clock * 4
.equ	RCC_CFGR_PLLMULL5,	0x000C0000	@ PLL input clock * 5
.equ	RCC_CFGR_PLLMULL6,	0x00100000	@ PLL input clock * 6
.equ	RCC_CFGR_PLLMULL7,	0x00140000	@ PLL input clock * 7
.equ	RCC_CFGR_PLLMULL8,	0x00180000	@ PLL input clock * 8
.equ	RCC_CFGR_PLLMULL9,	0x001C0000	@ PLL input clock * 9
.equ	RCC_CFGR_PLLMULL6_5,	0x00340000	@ PLL input clock * 6.5

.equ	RCC_CFGR_OTGFSPRE,	0x00400000	@ USB OTG FS prescaler

@ MCO configuration
.equ	RCC_CFGR_MCO,	0x0F000000	@ MCO[3:0] bits (Microcontroller Clock Output)
.equ	RCC_CFGR_MCO_0,	0x01000000	@ Bit 0
.equ	RCC_CFGR_MCO_1,	0x02000000	@ Bit 1
.equ	RCC_CFGR_MCO_2,	0x04000000	@ Bit 2
.equ	RCC_CFGR_MCO_3,	0x08000000	@ Bit 3

.equ	RCC_CFGR_MCO_NOCLOCK,	0x00000000	@ No clock
.equ	RCC_CFGR_MCO_SYSCLK,	0x04000000	@ System clock selected as MCO source
.equ	RCC_CFGR_MCO_HSI,	0x05000000	@ HSI clock selected as MCO source
.equ	RCC_CFGR_MCO_HSE,	0x06000000	@ HSE clock selected as MCO source
.equ	RCC_CFGR_MCO_PLLCLK_Div2,	0x07000000	@ PLL clock divided by 2 selected as MCO source
.equ	RCC_CFGR_MCO_PLL2CLK,	0x08000000	@ PLL2 clock selected as MCO source
.equ	RCC_CFGR_MCO_PLL3CLK_Div2,	0x09000000	@ PLL3 clock divided by 2 selected as MCO source
.equ	RCC_CFGR_MCO_Ext_HSE,	0x0A000000	@ XT1 external 3-25 MHz oscillator clock selected as MCO source
.equ	RCC_CFGR_MCO_PLL3CLK,	0x0B000000	@ PLL3 clock selected as MCO source

.else

.equ	RCC_CFGR_PLLSRC_HSI_Div2,	0x00000000	@ HSI clock divided by 2 selected as PLL entry clock source
.equ	RCC_CFGR_PLLSRC_HSE,	0x00010000	@ HSE clock selected as PLL entry clock source

.equ	RCC_CFGR_PLLXTPRE_HSE,	0x00000000	@ HSE clock not divided for PLL entry
.equ	RCC_CFGR_PLLXTPRE_HSE_Div2,	0x00020000	@ HSE clock divided by 2 for PLL entry

.equ	RCC_CFGR_PLLMULL2,	0x00000000	@ PLL input clock*2
.equ	RCC_CFGR_PLLMULL3,	0x00040000	@ PLL input clock*3
.equ	RCC_CFGR_PLLMULL4,	0x00080000	@ PLL input clock*4
.equ	RCC_CFGR_PLLMULL5,	0x000C0000	@ PLL input clock*5
.equ	RCC_CFGR_PLLMULL6,	0x00100000	@ PLL input clock*6
.equ	RCC_CFGR_PLLMULL7,	0x00140000	@ PLL input clock*7
.equ	RCC_CFGR_PLLMULL8,	0x00180000	@ PLL input clock*8
.equ	RCC_CFGR_PLLMULL9,	0x001C0000	@ PLL input clock*9
.equ	RCC_CFGR_PLLMULL10,	0x00200000	@ PLL input clock10
.equ	RCC_CFGR_PLLMULL11,	0x00240000	@ PLL input clock*11
.equ	RCC_CFGR_PLLMULL12,	0x00280000	@ PLL input clock*12
.equ	RCC_CFGR_PLLMULL13,	0x002C0000	@ PLL input clock*13
.equ	RCC_CFGR_PLLMULL14,	0x00300000	@ PLL input clock*14
.equ	RCC_CFGR_PLLMULL15,	0x00340000	@ PLL input clock*15
.equ	RCC_CFGR_PLLMULL16,	0x00380000	@ PLL input clock*16
.equ	RCC_CFGR_USBPRE,	0x00400000	@ USB Device prescaler

