seradya/Lab1_Asm/Lab1_HelloWorld/Core/Asm/stm32l1xx.s
@ MCO configuration
.equ	RCC_CFGR_MCO,	0x07000000	@ MCO[2:0] bits (Microcontroller Clock Output)
.equ	RCC_CFGR_MCO_0,	0x01000000	@ Bit 0
.equ	RCC_CFGR_MCO_1,	0x02000000	@ Bit 1
.equ	RCC_CFGR_MCO_2,	0x04000000	@ Bit 2

.equ	RCC_CFGR_MCO_NOCLOCK,	0x00000000	@ No clock
.equ	RCC_CFGR_MCO_SYSCLK,	0x04000000	@ System clock selected as MCO source
.equ	RCC_CFGR_MCO_HSI,	0x05000000	@ HSI clock selected as MCO source
.equ	RCC_CFGR_MCO_HSE,	0x06000000	@ HSE clock selected as MCO source
.equ	RCC_CFGR_MCO_PLL,	0x07000000	@ PLL clock divided by 2 selected as MCO source

.endif @ STM32F10X_CL

@ * Bit definition for RCC_CIR register
.equ	RCC_CIR_LSIRDYF,	0x00000001	@ LSI Ready Interrupt flag
.equ	RCC_CIR_LSERDYF,	0x00000002	@ LSE Ready Interrupt flag
.equ	RCC_CIR_HSIRDYF,	0x00000004	@ HSI Ready Interrupt flag
.equ	RCC_CIR_HSERDYF,	0x00000008	@ HSE Ready Interrupt flag
.equ	RCC_CIR_PLLRDYF,	0x00000010	@ PLL Ready Interrupt flag
.equ	RCC_CIR_CSSF,	0x00000080	@ Clock Security System Interrupt flag
.equ	RCC_CIR_LSIRDYIE,	0x00000100	@ LSI Ready Interrupt Enable
.equ	RCC_CIR_LSERDYIE,	0x00000200	@ LSE Ready Interrupt Enable
.equ	RCC_CIR_HSIRDYIE,	0x00000400	@ HSI Ready Interrupt Enable
.equ	RCC_CIR_HSERDYIE,	0x00000800	@ HSE Ready Interrupt Enable
.equ	RCC_CIR_PLLRDYIE,	0x00001000	@ PLL Ready Interrupt Enable
.equ	RCC_CIR_LSIRDYC,	0x00010000	@ LSI Ready Interrupt Clear
.equ	RCC_CIR_LSERDYC,	0x00020000	@ LSE Ready Interrupt Clear
.equ	RCC_CIR_HSIRDYC,	0x00040000	@ HSI Ready Interrupt Clear
.equ	RCC_CIR_HSERDYC,	0x00080000	@ HSE Ready Interrupt Clear
.equ	RCC_CIR_PLLRDYC,	0x00100000	@ PLL Ready Interrupt Clear
.equ	RCC_CIR_CSSC,	0x00800000	@ Clock Security System Interrupt Clear

.ifdef STM32F10X_CL
.equ	RCC_CIR_PLL2RDYF,	0x00000020	@ PLL2 Ready Interrupt flag
.equ	RCC_CIR_PLL3RDYF,	0x00000040	@ PLL3 Ready Interrupt flag
.equ	RCC_CIR_PLL2RDYIE,	0x00002000	@ PLL2 Ready Interrupt Enable
.equ	RCC_CIR_PLL3RDYIE,	0x00004000	@ PLL3 Ready Interrupt Enable
.equ	RCC_CIR_PLL2RDYC,	0x00200000	@ PLL2 Ready Interrupt Clear
.equ	RCC_CIR_PLL3RDYC,	0x00400000	@ PLL3 Ready Interrupt Clear
.endif @ STM32F10X_CL

@ Bit definition for RCC_APB2RSTR register
.equ	RCC_APB2RSTR_AFIORST,	0x0001	@ Alternate Function I/O reset
.equ	RCC_APB2RSTR_IOPARST,	0x0004	@ I/O port A reset
.equ	RCC_APB2RSTR_IOPBRST,	0x0008	@ I/O port B reset
.equ	RCC_APB2RSTR_IOPCRST,	0x0010	@ I/O port C reset
.equ	RCC_APB2RSTR_IOPDRST,	0x0020	@ I/O port D reset
.equ	RCC_APB2RSTR_ADC1RST,	0x0200	@ ADC 1 interface reset
.equ	RCC_APB2RSTR_ADC2RST,	0x0400	@ ADC 2 interface reset
.equ	RCC_APB2RSTR_TIM1RST,	0x0800	@ TIM1 Timer reset
.equ	RCC_APB2RSTR_SPI1RST,	0x1000	@ SPI 1 reset
.equ	RCC_APB2RSTR_USART1RST,	0x4000	@ USART1 reset

.ifdef STM32F10X_LD
RCC_APB2RSTR_IOPERST,	0x0040	@ I/O port E reset
.endif @ STM32F10X_LD

.ifdef	STM32F10X_HD
.equ	RCC_APB2RSTR_IOPFRST,	0x0080	@ I/O port F reset
.equ	RCC_APB2RSTR_IOPGRST,	0x0100	@ I/O port G reset
.equ	RCC_APB2RSTR_TIM8RST,	0x2000	@ TIM8 Timer reset
.equ	RCC_APB2RSTR_ADC3RST,	0x8000	@ ADC3 interface reset
.endif @ STM32F10X_HD

@ Bit definition for RCC_APB1RSTR register
.equ	RCC_APB1RSTR_TIM2RST,	0x00000001	@ Timer 2 reset
.equ	RCC_APB1RSTR_TIM3RST,	0x00000002	@ Timer 3 reset
.equ	RCC_APB1RSTR_WWDGRST,	0x00000800	@ Window Watchdog reset
.equ	RCC_APB1RSTR_USART2RST,	0x00020000	@ USART 2 reset
.equ	RCC_APB1RSTR_I2C1RST,	0x00200000	@ I2C 1 reset
.equ	RCC_APB1RSTR_CAN1RST,	0x02000000	@ CAN1 reset
.equ	RCC_APB1RSTR_BKPRST,	0x08000000	@ Backup interface reset
.equ	RCC_APB1RSTR_PWRRST,	0x10000000	@ Power interface reset

.ifdef STM32F10X_LD
.equ	RCC_APB1RSTR_TIM4RST,	0x00000004	@ Timer 4 reset
.equ	RCC_APB1RSTR_SPI2RST,	0x00004000	@ SPI 2 reset
.equ	RCC_APB1RSTR_USART3RST,	0x00040000	@ RUSART 3 reset
.equ	RCC_APB1RSTR_I2C2RST,	0x00400000	@ I2C 2 reset
.endif


@.ifdef (STM32F10X_HD || STM32F10X_MD || STM32F10X_LD)
#if defined(STM32F10X_HD) || defined(STM32F10X_MD) || defined(STM32F10X_LD)
.equ	RCC_APB1RSTR_USBRST,	0x00800000	@ USB Device reset
#endif


#if defined (STM32F10X_HD) || defined(STM32F10X_CL)
.equ	RCC_APB1RSTR_TIM5RST,	0x00000008	@ Timer 5 reset
.equ	RCC_APB1RSTR_TIM6RST,	0x00000010	@ Timer 6 reset
.equ	RCC_APB1RSTR_TIM7RST,	0x00000020	@ Timer 7 reset
.equ	RCC_APB1RSTR_SPI3RST,	0x00008000	@ SPI 3 reset
.equ	RCC_APB1RSTR_USART4RST,	0x00080000	@ UART 4 reset
.equ	RCC_APB1RSTR_USART5RST,	0x00100000	@ UART 5 reset
.equ	RCC_APB1RSTR_DACRST,	0x20000000	@ DAC interface reset
#endif

.ifdef STM32F10X_CL
.equ	RCC_APB1RSTR_CAN2RST,	0x08000000	@ CAN2 reset
.endif

@ Bit definition for RCC_AHBENR register
.equ	RCC_AHBENR_DMA1EN,	0x0001	@ DMA1 clock enable
.equ	RCC_AHBENR_SRAMEN,	0x0004	@ SRAM interface clock enable
.equ	RCC_AHBENR_FLITFEN,	0x0010	@ FLITF clock enable
.equ	RCC_AHBENR_CRCEN,	0x0040	@ CRC clock enable

#if defined (STM32F10X_HD) || defined(STM32F10X_CL)
.equ	RCC_AHBENR_DMA2EN,	0x0002	@ DMA2 clock enable
#endif

.ifdef STM32F10X_HD
.equ	RCC_AHBENR_FSMCEN,	0x0100	@ FSMC clock enable
.equ	RCC_AHBENR_SDIOEN,	0x0400	@ SDIO clock enable
.endif

.ifdef STM32F10X_CL
.equ	RCC_AHBENR_OTGFSEN,	0x00001000	@ USB OTG FS clock enable
.equ	RCC_AHBENR_ETHMACEN,	0x00004000	@ ETHERNET MAC clock enable
.equ	RCC_AHBENR_ETHMACTXEN,	0x00008000	@ ETHERNET MAC Tx clock enable
.equ	RCC_AHBENR_ETHMACRXEN,	0x00010000	@ ETHERNET MAC Rx clock enable
.endif

@ Bit definition for RCC_APB2ENR register
.equ	RCC_APB2ENR_AFIOEN,	0x0001	@ Alternate Function I/O clock enable
.equ	RCC_APB2ENR_IOPAEN,	0x0004	@ I/O port A clock enable
.equ	RCC_APB2ENR_IOPBEN,	0x0008	@ I/O port B clock enable
.equ	RCC_APB2ENR_IOPCEN,	0x0010	@ I/O port C clock enable
.equ	RCC_APB2ENR_IOPDEN,	0x0020	@ I/O port D clock enable
.equ	RCC_APB2ENR_ADC1EN,	0x0200	@ ADC 1 interface clock enable
.equ	RCC_APB2ENR_ADC2EN,	0x0400	@ ADC 2 interface clock enable
.equ	RCC_APB2ENR_TIM1EN,	0x0800	@ TIM1 Timer clock enable
.equ	RCC_APB2ENR_SPI1EN,	0x1000	@ SPI 1 clock enable
.equ	RCC_APB2ENR_USART1EN,	0x4000	@ USART1 clock enable

.ifdef STM32F10X_LD
.equ	RCC_APB2ENR_IOPEEN,	0x0040	@ I/O port E clock enable
.endif

