seradya/Lab1_Asm/Lab1_HelloWorld/Core/Asm/stm32l1xx.s
.equ	RCC_CFGR2_PLL3MUL8,	0x00006000	@ PLL3 input clock * 8
.equ	RCC_CFGR2_PLL3MUL9,	0x00007000	@ PLL3 input clock * 9
.equ	RCC_CFGR2_PLL3MUL10,	0x00008000	@ PLL3 input clock * 10
.equ	RCC_CFGR2_PLL3MUL11,	0x00009000	@ PLL3 input clock * 11
.equ	RCC_CFGR2_PLL3MUL12,	0x0000A000	@ PLL3 input clock * 12
.equ	RCC_CFGR2_PLL3MUL13,	0x0000B000	@ PLL3 input clock * 13
.equ	RCC_CFGR2_PLL3MUL14,	0x0000C000	@ PLL3 input clock * 14
.equ	RCC_CFGR2_PLL3MUL16,	0x0000E000	@ PLL3 input clock * 16
.equ	RCC_CFGR2_PLL3MUL20,	0x0000F000	@ PLL3 input clock * 20

.equ	RCC_CFGR2_PREDIV1SRC,	0x00010000	@ PREDIV1 entry clock source
.equ	RCC_CFGR2_PREDIV1SRC_PLL2,	0x00010000	@ PLL2 selected as PREDIV1 entry clock source
.equ	RCC_CFGR2_PREDIV1SRC_HSE,	0x00000000	@ HSE selected as PREDIV1 entry clock source
.equ	RCC_CFGR2_I2S2SRC,	0x00020000	@ I2S2 entry clock source
.equ	RCC_CFGR2_I2S3SRC,	0x00040000	@ I2S3 clock source
.endif @ STM32F10X_CL


@
@ General Purpose and Alternate Function I/O
@


@ Bit definition for GPIO_CRL register
.equ	GPIO_CRL_MODE,	0x33333333	@ Port x mode bits

.equ	GPIO_CRL_MODE0,	0x00000003	@ MODE0[1:0] bits (Port x mode bits, pin 0)
.equ	GPIO_CRL_MODE0_0,	0x00000001	@ Bit 0
.equ	GPIO_CRL_MODE0_1,	0x00000002	@ Bit 1

.equ	GPIO_CRL_MODE1,	0x00000030	@ MODE1[1:0] bits (Port x mode bits, pin 1)
.equ	GPIO_CRL_MODE1_0,	0x00000010	@ Bit 0
.equ	GPIO_CRL_MODE1_1,	0x00000020	@ Bit 1

.equ	GPIO_CRL_MODE2,	0x00000300	@ MODE2[1:0] bits (Port x mode bits, pin 2)
.equ	GPIO_CRL_MODE2_0,	0x00000100	@ Bit 0
.equ	GPIO_CRL_MODE2_1,	0x00000200	@ Bit 1

.equ	GPIO_CRL_MODE3,	0x00003000	@ MODE3[1:0] bits (Port x mode bits, pin 3)
.equ	GPIO_CRL_MODE3_0,	0x00001000	@ Bit 0
.equ	GPIO_CRL_MODE3_1,	0x00002000	@ Bit 1

.equ	GPIO_CRL_MODE4,	0x00030000	@ MODE4[1:0] bits (Port x mode bits, pin 4)
.equ	GPIO_CRL_MODE4_0,	0x00010000	@ Bit 0
.equ	GPIO_CRL_MODE4_1,	0x00020000	@ Bit 1

.equ	GPIO_CRL_MODE5,	0x00300000	@ MODE5[1:0] bits (Port x mode bits, pin 5)
.equ	GPIO_CRL_MODE5_0,	0x00100000	@ Bit 0
.equ	GPIO_CRL_MODE5_1,	0x00200000	@ Bit 1

.equ	GPIO_CRL_MODE6,	0x03000000	@ MODE6[1:0] bits (Port x mode bits, pin 6)
.equ	GPIO_CRL_MODE6_0,	0x01000000	@ Bit 0
.equ	GPIO_CRL_MODE6_1,	0x02000000	@ Bit 1

.equ	GPIO_CRL_MODE7,	0x30000000	@ MODE7[1:0] bits (Port x mode bits, pin 7)
.equ	GPIO_CRL_MODE7_0,	0x10000000	@ Bit 0
.equ	GPIO_CRL_MODE7_1,	0x20000000	@ Bit 1

.equ	GPIO_CRL_CNF,	0xCCCCCCCC	@ Port x configuration bits

.equ	GPIO_CRL_CNF0,	0x0000000C	@ CNF0[1:0] bits (Port x configuration bits, pin 0)
.equ	GPIO_CRL_CNF0_0,	0x00000004	@ Bit 0
.equ	GPIO_CRL_CNF0_1,	0x00000008	@ Bit 1

.equ	GPIO_CRL_CNF1,	0x000000C0	@ CNF1[1:0] bits (Port x configuration bits, pin 1)
.equ	GPIO_CRL_CNF1_0,	0x00000040	@ Bit 0
.equ	GPIO_CRL_CNF1_1,	0x00000080	@ Bit 1

.equ	GPIO_CRL_CNF2,	0x00000C00	@ CNF2[1:0] bits (Port x configuration bits, pin 2)
.equ	GPIO_CRL_CNF2_0,	0x00000400	@ Bit 0
.equ	GPIO_CRL_CNF2_1,	0x00000800	@ Bit 1

.equ	GPIO_CRL_CNF3,	0x0000C000	@ CNF3[1:0] bits (Port x configuration bits, pin 3)
.equ	GPIO_CRL_CNF3_0,	0x00004000	@ Bit 0
.equ	GPIO_CRL_CNF3_1,	0x00008000	@ Bit 1

.equ	GPIO_CRL_CNF4,	0x000C0000	@ CNF4[1:0] bits (Port x configuration bits, pin 4)
.equ	GPIO_CRL_CNF4_0,	0x00040000	@ Bit 0
.equ	GPIO_CRL_CNF4_1,	0x00080000	@ Bit 1

.equ	GPIO_CRL_CNF5,	0x00C00000	@ CNF5[1:0] bits (Port x configuration bits, pin 5)
.equ	GPIO_CRL_CNF5_0,	0x00400000	@ Bit 0
.equ	GPIO_CRL_CNF5_1,	0x00800000	@ Bit 1

.equ	GPIO_CRL_CNF6,	0x0C000000	@ CNF6[1:0] bits (Port x configuration bits, pin 6)
.equ	GPIO_CRL_CNF6_0,	0x04000000	@ Bit 0
.equ	GPIO_CRL_CNF6_1,	0x08000000	@ Bit 1

.equ	GPIO_CRL_CNF7,	0xC0000000	@ CNF7[1:0] bits (Port x configuration bits, pin 7)
.equ	GPIO_CRL_CNF7_0,	0x40000000	@ Bit 0
.equ	GPIO_CRL_CNF7_1,	0x80000000	@ Bit 1

@ Bit definition for GPIO_CRH register
.equ	GPIO_CRH_MODE,	0x33333333	@ Port x mode bits

.equ	GPIO_CRH_MODE8,	0x00000003	@ MODE8[1:0] bits (Port x mode bits, pin 8)
.equ	GPIO_CRH_MODE8_0,	0x00000001	@ Bit 0
.equ	GPIO_CRH_MODE8_1,	0x00000002	@ Bit 1

.equ	GPIO_CRH_MODE9,	0x00000030	@ MODE9[1:0] bits (Port x mode bits, pin 9)
.equ	GPIO_CRH_MODE9_0,	0x00000010	@ Bit 0
.equ	GPIO_CRH_MODE9_1,	0x00000020	@ Bit 1

.equ	GPIO_CRH_MODE10,	0x00000300	@ MODE10[1:0] bits (Port x mode bits, pin 10)
.equ	GPIO_CRH_MODE10_0,	0x00000100	@ Bit 0
.equ	GPIO_CRH_MODE10_1,	0x00000200	@ Bit 1

.equ	GPIO_CRH_MODE11,	0x00003000	@ MODE11[1:0] bits (Port x mode bits, pin 11)
.equ	GPIO_CRH_MODE11_0,	0x00001000	@ Bit 0
.equ	GPIO_CRH_MODE11_1,	0x00002000	@ Bit 1

.equ	GPIO_CRH_MODE12,	0x00030000	@ MODE12[1:0] bits (Port x mode bits, pin 12)
.equ	GPIO_CRH_MODE12_0,	0x00010000	@ Bit 0
.equ	GPIO_CRH_MODE12_1,	0x00020000	@ Bit 1

.equ	GPIO_CRH_MODE13,	0x00300000	@ MODE13[1:0] bits (Port x mode bits, pin 13)
.equ	GPIO_CRH_MODE13_0,	0x00100000	@ Bit 0
.equ	GPIO_CRH_MODE13_1,	0x00200000	@ Bit 1

.equ	GPIO_CRH_MODE14,	0x03000000	@ MODE14[1:0] bits (Port x mode bits, pin 14)
.equ	GPIO_CRH_MODE14_0,	0x01000000	@ Bit 0
.equ	GPIO_CRH_MODE14_1,	0x02000000	@ Bit 1

.equ	GPIO_CRH_MODE15,	0x30000000	@ MODE15[1:0] bits (Port x mode bits, pin 15)
.equ	GPIO_CRH_MODE15_0,	0x10000000	@ Bit 0
.equ	GPIO_CRH_MODE15_1,	0x20000000	@ Bit 1

.equ	GPIO_CRH_CNF,	0xCCCCCCCC	@ Port x configuration bits

.equ	GPIO_CRH_CNF8,	0x0000000C	@ CNF8[1:0] bits (Port x configuration bits, pin 8)
.equ	GPIO_CRH_CNF8_0,	0x00000004	@ Bit 0
.equ	GPIO_CRH_CNF8_1,	0x00000008	@ Bit 1

.equ	GPIO_CRH_CNF9,	0x000000C0	@ CNF9[1:0] bits (Port x configuration bits, pin 9)
.equ	GPIO_CRH_CNF9_0,	0x00000040	@ Bit 0
.equ	GPIO_CRH_CNF9_1,	0x00000080	@ Bit 1

.equ	GPIO_CRH_CNF10,	0x00000C00	@ CNF10[1:0] bits (Port x configuration bits, pin 10)
.equ	GPIO_CRH_CNF10_0,	0x00000400	@ Bit 0
.equ	GPIO_CRH_CNF10_1,	0x00000800	@ Bit 1

.equ	GPIO_CRH_CNF11,	0x0000C000	@ CNF11[1:0] bits (Port x configuration bits, pin 11)
.equ	GPIO_CRH_CNF11_0,	0x00004000	@ Bit 0
.equ	GPIO_CRH_CNF11_1,	0x00008000	@ Bit 1

.equ	GPIO_CRH_CNF12,	0x000C0000	@ CNF12[1:0] bits (Port x configuration bits, pin 12)
.equ	GPIO_CRH_CNF12_0,	0x00040000	@ Bit 0
.equ	GPIO_CRH_CNF12_1,	0x00080000	@ Bit 1

.equ	GPIO_CRH_CNF13,	0x00C00000	@ CNF13[1:0] bits (Port x configuration bits, pin 13)
.equ	GPIO_CRH_CNF13_0,	0x00400000	@ Bit 0
.equ	GPIO_CRH_CNF13_1,	0x00800000	@ Bit 1

.equ	GPIO_CRH_CNF14,	0x0C000000	@ CNF14[1:0] bits (Port x configuration bits, pin 14)
.equ	GPIO_CRH_CNF14_0,	0x04000000	@ Bit 0
.equ	GPIO_CRH_CNF14_1,	0x08000000	@ Bit 1

.equ	GPIO_CRH_CNF15,	0xC0000000	@ CNF15[1:0] bits (Port x configuration bits, pin 15)
.equ	GPIO_CRH_CNF15_0,	0x40000000	@ Bit 0
.equ	GPIO_CRH_CNF15_1,	0x80000000	@ Bit 1

@ * Bit definition for GPIO_IDR register
.equ	GPIO_IDR_IDR0,	0x0001	@ Port input data, bit 0
.equ	GPIO_IDR_IDR1,	0x0002	@ Port input data, bit 1
.equ	GPIO_IDR_IDR2,	0x0004	@ Port input data, bit 2
.equ	GPIO_IDR_IDR3,	0x0008	@ Port input data, bit 3
.equ	GPIO_IDR_IDR4,	0x0010	@ Port input data, bit 4
.equ	GPIO_IDR_IDR5,	0x0020	@ Port input data, bit 5
.equ	GPIO_IDR_IDR6,	0x0040	@ Port input data, bit 6
.equ	GPIO_IDR_IDR7,	0x0080	@ Port input data, bit 7
.equ	GPIO_IDR_IDR8,	0x0100	@ Port input data, bit 8
.equ	GPIO_IDR_IDR9,	0x0200	@ Port input data, bit 9
.equ	GPIO_IDR_IDR10,	0x0400	@ Port input data, bit 10
.equ	GPIO_IDR_IDR11,	0x0800	@ Port input data, bit 11
.equ	GPIO_IDR_IDR12,	0x1000	@ Port input data, bit 12
.equ	GPIO_IDR_IDR13,	0x2000	@ Port input data, bit 13
.equ	GPIO_IDR_IDR14,	0x4000	@ Port input data, bit 14
.equ	GPIO_IDR_IDR15,	0x8000	@ Port input data, bit 15

@ Bit definition for GPIO_ODR register
.equ	GPIO_ODR_ODR0,	0x0001	@ Port output data, bit 0
.equ	GPIO_ODR_ODR1,	0x0002	@ Port output data, bit 1
.equ	GPIO_ODR_ODR2,	0x0004	@ Port output data, bit 2
.equ	GPIO_ODR_ODR3,	0x0008	@ Port output data, bit 3
.equ	GPIO_ODR_ODR4,	0x0010	@ Port output data, bit 4
.equ	GPIO_ODR_ODR5,	0x0020	@ Port output data, bit 5
.equ	GPIO_ODR_ODR6,	0x0040	@ Port output data, bit 6
.equ	GPIO_ODR_ODR7,	0x0080	@ Port output data, bit 7
.equ	GPIO_ODR_ODR8,	0x0100	@ Port output data, bit 8
.equ	GPIO_ODR_ODR9,	0x0200	@ Port output data, bit 9
.equ	GPIO_ODR_ODR10,	0x0400	@ Port output data, bit 10
.equ	GPIO_ODR_ODR11,	0x0800	@ Port output data, bit 11
.equ	GPIO_ODR_ODR12,	0x1000	@ Port output data, bit 12
.equ	GPIO_ODR_ODR13,	0x2000	@ Port output data, bit 13
.equ	GPIO_ODR_ODR14,	0x4000	@ Port output data, bit 14
.equ	GPIO_ODR_ODR15,	0x8000	@ Port output data, bit 15

@ Bit definition for GPIO_BSRR register
.equ	GPIO_BSRR_BS0,	0x00000001	@ Port x Set bit 0
.equ	GPIO_BSRR_BS1,	0x00000002	@ Port x Set bit 1
.equ	GPIO_BSRR_BS2,	0x00000004	@ Port x Set bit 2
.equ	GPIO_BSRR_BS3,	0x00000008	@ Port x Set bit 3
.equ	GPIO_BSRR_BS4,	0x00000010	@ Port x Set bit 4
.equ	GPIO_BSRR_BS5,	0x00000020	@ Port x Set bit 5
.equ	GPIO_BSRR_BS6,	0x00000040	@ Port x Set bit 6
.equ	GPIO_BSRR_BS7,	0x00000080	@ Port x Set bit 7
.equ	GPIO_BSRR_BS8,	0x00000100	@ Port x Set bit 8
.equ	GPIO_BSRR_BS9,	0x00000200	@ Port x Set bit 9
.equ	GPIO_BSRR_BS10,	0x00000400	@ Port x Set bit 10
.equ	GPIO_BSRR_BS11,	0x00000800	@ Port x Set bit 11
.equ	GPIO_BSRR_BS12,	0x00001000	@ Port x Set bit 12
.equ	GPIO_BSRR_BS13,	0x00002000	@ Port x Set bit 13
.equ	GPIO_BSRR_BS14,	0x00004000	@ Port x Set bit 14
.equ	GPIO_BSRR_BS15,	0x00008000	@ Port x Set bit 15

.equ	GPIO_BSRR_BR0,	0x00010000	@ Port x Reset bit 0
.equ	GPIO_BSRR_BR1,	0x00020000	@ Port x Reset bit 1
.equ	GPIO_BSRR_BR2,	0x00040000	@ Port x Reset bit 2
.equ	GPIO_BSRR_BR3,	0x00080000	@ Port x Reset bit 3
.equ	GPIO_BSRR_BR4,	0x00100000	@ Port x Reset bit 4
.equ	GPIO_BSRR_BR5,	0x00200000	@ Port x Reset bit 5
.equ	GPIO_BSRR_BR6,	0x00400000	@ Port x Reset bit 6
.equ	GPIO_BSRR_BR7,	0x00800000	@ Port x Reset bit 7
.equ	GPIO_BSRR_BR8,	0x01000000	@ Port x Reset bit 8
.equ	GPIO_BSRR_BR9,	0x02000000	@ Port x Reset bit 9
.equ	GPIO_BSRR_BR10,	0x04000000	@ Port x Reset bit 10
.equ	GPIO_BSRR_BR11,	0x08000000	@ Port x Reset bit 11
.equ	GPIO_BSRR_BR12,	0x10000000	@ Port x Reset bit 12
.equ	GPIO_BSRR_BR13,	0x20000000	@ Port x Reset bit 13
.equ	GPIO_BSRR_BR14,	0x40000000	@ Port x Reset bit 14
.equ	GPIO_BSRR_BR15,	0x80000000	@ Port x Reset bit 15

