seradya/Lab1_Asm/Lab1_HelloWorld/Core/Asm/stm32l1xx.s
@ Bit definition for GPIO_BRR register
.equ	GPIO_BRR_BR0,	0x0001	@ Port x Reset bit 0
.equ	GPIO_BRR_BR1,	0x0002	@ Port x Reset bit 1
.equ	GPIO_BRR_BR2,	0x0004	@ Port x Reset bit 2
.equ	GPIO_BRR_BR3,	0x0008	@ Port x Reset bit 3
.equ	GPIO_BRR_BR4,	0x0010	@ Port x Reset bit 4
.equ	GPIO_BRR_BR5,	0x0020	@ Port x Reset bit 5
.equ	GPIO_BRR_BR6,	0x0040	@ Port x Reset bit 6
.equ	GPIO_BRR_BR7,	0x0080	@ Port x Reset bit 7
.equ	GPIO_BRR_BR8,	0x0100	@ Port x Reset bit 8
.equ	GPIO_BRR_BR9,	0x0200	@ Port x Reset bit 9
.equ	GPIO_BRR_BR10,	0x0400	@ Port x Reset bit 10
.equ	GPIO_BRR_BR11,	0x0800	@ Port x Reset bit 11
.equ	GPIO_BRR_BR12,	0x1000	@ Port x Reset bit 12
.equ	GPIO_BRR_BR13,	0x2000	@ Port x Reset bit 13
.equ	GPIO_BRR_BR14,	0x4000	@ Port x Reset bit 14
.equ	GPIO_BRR_BR15,	0x8000	@ Port x Reset bit 15

@ Bit definition for GPIO_LCKR register
.equ	GPIO_LCKR_LCK0,	0x00000001	@ Port x Lock bit 0
.equ	GPIO_LCKR_LCK1,	0x00000002	@ Port x Lock bit 1
.equ	GPIO_LCKR_LCK2,	0x00000004	@ Port x Lock bit 2
.equ	GPIO_LCKR_LCK3,	0x00000008	@ Port x Lock bit 3
.equ	GPIO_LCKR_LCK4,	0x00000010	@ Port x Lock bit 4
.equ	GPIO_LCKR_LCK5,	0x00000020	@ Port x Lock bit 5
.equ	GPIO_LCKR_LCK6,	0x00000040	@ Port x Lock bit 6
.equ	GPIO_LCKR_LCK7,	0x00000080	@ Port x Lock bit 7
.equ	GPIO_LCKR_LCK8,	0x00000100	@ Port x Lock bit 8
.equ	GPIO_LCKR_LCK9,	0x00000200	@ Port x Lock bit 9
.equ	GPIO_LCKR_LCK10,	0x00000400	@ Port x Lock bit 10
.equ	GPIO_LCKR_LCK11,	0x00000800	@ Port x Lock bit 11
.equ	GPIO_LCKR_LCK12,	0x00001000	@ Port x Lock bit 12
.equ	GPIO_LCKR_LCK13,	0x00002000	@ Port x Lock bit 13
.equ	GPIO_LCKR_LCK14,	0x00004000	@ Port x Lock bit 14
.equ	GPIO_LCKR_LCK15,	0x00008000	@ Port x Lock bit 15
.equ	GPIO_LCKR_LCKK,	0x00010000	@ Lock key

@ Отдельные пины I/O
.equ	PIN0,	0x00000001
.equ	PIN1,	0x00000002
.equ	PIN2,	0x00000004
.equ	PIN3,	0x00000008
.equ	PIN4,	0x00000010
.equ	PIN5,	0x00000020
.equ	PIN6,	0x00000040
.equ	PIN7,	0x00000080
.equ	PIN8,	0x00000100
.equ	PIN9,	0x00000200
.equ	PIN10,	0x00000400
.equ	PIN11,	0x00000800
.equ	PIN12,	0x00001000
.equ	PIN13,	0x00002000
.equ	PIN14,	0x00004000
.equ	PIN15,	0x00008000


@----------------------------------------------------------------------------

@ Bit definition for AFIO_EVCR register
.equ	AFIO_EVCR_PIN,	0x0F	@ PIN[3:0] bits (Pin selection)
.equ	AFIO_EVCR_PIN_0,	0x01	@ Bit 0
.equ	AFIO_EVCR_PIN_1,	0x02	@ Bit 1
.equ	AFIO_EVCR_PIN_2,	0x04	@ Bit 2
.equ	AFIO_EVCR_PIN_3,	0x08	@ Bit 3

@ PIN configuration
.equ	AFIO_EVCR_PIN_PX0,	0x00	@ Pin 0 selected
.equ	AFIO_EVCR_PIN_PX1,	0x01	@ Pin 1 selected
.equ	AFIO_EVCR_PIN_PX2,	0x02	@ Pin 2 selected
.equ	AFIO_EVCR_PIN_PX3,	0x03	@ Pin 3 selected
.equ	AFIO_EVCR_PIN_PX4,	0x04	@ Pin 4 selected
.equ	AFIO_EVCR_PIN_PX5,	0x05	@ Pin 5 selected
.equ	AFIO_EVCR_PIN_PX6,	0x06	@ Pin 6 selected
.equ	AFIO_EVCR_PIN_PX7,	0x07	@ Pin 7 selected
.equ	AFIO_EVCR_PIN_PX8,	0x08	@ Pin 8 selected
.equ	AFIO_EVCR_PIN_PX9,	0x09	@ Pin 9 selected
.equ	AFIO_EVCR_PIN_PX10,	0x0A	@ Pin 10 selected
.equ	AFIO_EVCR_PIN_PX11,	0x0B	@ Pin 11 selected
.equ	AFIO_EVCR_PIN_PX12,	0x0C	@ Pin 12 selected
.equ	AFIO_EVCR_PIN_PX13,	0x0D	@ Pin 13 selected
.equ	AFIO_EVCR_PIN_PX14,	0x0E	@ Pin 14 selected
.equ	AFIO_EVCR_PIN_PX15,	0x0F	@ Pin 15 selected

.equ	AFIO_EVCR_PORT,	0x70	@ PORT[2:0] bits (Port selection)
.equ	AFIO_EVCR_PORT_0,	0x10	@ Bit 0
.equ	AFIO_EVCR_PORT_1,	0x20	@ Bit 1
.equ	AFIO_EVCR_PORT_2,	0x40	@ Bit 2

@ PORT configuration
.equ	AFIO_EVCR_PORT_PA,	0x00	@ Port A selected
.equ	AFIO_EVCR_PORT_PB,	0x10	@ Port B selected
.equ	AFIO_EVCR_PORT_PC,	0x20	@ Port C selected
.equ	AFIO_EVCR_PORT_PD,	0x30	@ Port D selected
.equ	AFIO_EVCR_PORT_PE,	0x40	@ Port E selected

.equ	AFIO_EVCR_EVOE,	0x80	@ Event Output Enable

@ Bit definition for AFIO_MAPR register
.equ	AFIO_MAPR_SPI1_REMAP,	0x00000001	@ SPI1 remapping
.equ	AFIO_MAPR_I2C1_REMAP,	0x00000002	@ I2C1 remapping
.equ	AFIO_MAPR_USART1_REMAP,	0x00000004	@ USART1 remapping
.equ	AFIO_MAPR_USART2_REMAP,	0x00000008	@ USART2 remapping

.equ	AFIO_MAPR_USART3_REMAP,	0x00000030	@ USART3_REMAP[1:0] bits (USART3 remapping)
.equ	AFIO_MAPR_USART3_REMAP_0,	0x00000010	@ Bit 0
.equ	AFIO_MAPR_USART3_REMAP_1,	0x00000020	@ Bit 1

@ USART3_REMAP configuration
.equ	AFIO_MAPR_USART3_REMAP_NOREMAP,	0x00000000	@ No remap (TX/PB10, RX/PB11, CK/PB12, CTS/PB13, RTS/PB14)
.equ	AFIO_MAPR_USART3_REMAP_PARTIALREMAP,	0x00000010 @ Partial remap (TX/PC10, RX/PC11, CK/PC12, CTS/PB13, RTS/PB14)
.equ	AFIO_MAPR_USART3_REMAP_FULLREMAP,	0x00000030	@ Full remap (TX/PD8, RX/PD9, CK/PD10, CTS/PD11, RTS/PD12)

.equ	AFIO_MAPR_TIM1_REMAP,	0x000000C0	@ TIM1_REMAP[1:0] bits (TIM1 remapping)
.equ	AFIO_MAPR_TIM1_REMAP_0,	0x00000040	@ Bit 0
.equ	AFIO_MAPR_TIM1_REMAP_1,	0x00000080	@ Bit 1

@ TIM1_REMAP configuration
.equ	AFIO_MAPR_TIM1_REMAP_NOREMAP,	0x00000000	@ No remap (ETR/PA12, CH1/PA8, CH2/PA9, CH3/PA10, CH4/PA11, BKIN/PB12, CH1N/PB13, CH2N/PB14, CH3N/PB15)
.equ	AFIO_MAPR_TIM1_REMAP_PARTIALREMAP,	0x00000040	@ Partial remap (ETR/PA12, CH1/PA8, CH2/PA9, CH3/PA10, CH4/PA11, BKIN/PA6, CH1N/PA7, CH2N/PB0, CH3N/PB1)
.equ	AFIO_MAPR_TIM1_REMAP_FULLREMAP,	0x000000C0	@ Full remap (ETR/PE7, CH1/PE9, CH2/PE11, CH3/PE13, CH4/PE14, BKIN/PE15, CH1N/PE8, CH2N/PE10, CH3N/PE12)

.equ	AFIO_MAPR_TIM2_REMAP,	0x00000300	@ TIM2_REMAP[1:0] bits (TIM2 remapping)
.equ	AFIO_MAPR_TIM2_REMAP_0,	0x00000100	@ Bit 0
.equ	AFIO_MAPR_TIM2_REMAP_1,	0x00000200	@ Bit 1

@ TIM2_REMAP configuration
.equ	AFIO_MAPR_TIM2_REMAP_NOREMAP,	0x00000000	@ No remap (CH1/ETR/PA0, CH2/PA1, CH3/PA2, CH4/PA3)
.equ	AFIO_MAPR_TIM2_REMAP_PARTIALREMAP1,	0x00000100	@ Partial remap (CH1/ETR/PA15, CH2/PB3, CH3/PA2, CH4/PA3)
.equ	AFIO_MAPR_TIM2_REMAP_PARTIALREMAP2,	0x00000200	@ Partial remap (CH1/ETR/PA0, CH2/PA1, CH3/PB10, CH4/PB11)
.equ	AFIO_MAPR_TIM2_REMAP_FULLREMAP,	0x00000300	@ Full remap (CH1/ETR/PA15, CH2/PB3, CH3/PB10, CH4/PB11)

.equ	AFIO_MAPR_TIM3_REMAP,	0x00000C00	@ TIM3_REMAP[1:0] bits (TIM3 remapping)
.equ	AFIO_MAPR_TIM3_REMAP_0,	0x00000400	@ Bit 0
.equ	AFIO_MAPR_TIM3_REMAP_1,	0x00000800	@ Bit 1

@ TIM3_REMAP configuration
.equ	AFIO_MAPR_TIM3_REMAP_NOREMAP,	0x00000000	@ No remap (CH1/PA6, CH2/PA7, CH3/PB0, CH4/PB1)
.equ	AFIO_MAPR_TIM3_REMAP_PARTIALREMAP,	0x00000800	@ Partial remap (CH1/PB4, CH2/PB5, CH3/PB0, CH4/PB1)
.equ	AFIO_MAPR_TIM3_REMAP_FULLREMAP,	0x00000C00	@ Full remap (CH1/PC6, CH2/PC7, CH3/PC8, CH4/PC9)

.equ	AFIO_MAPR_TIM4_REMAP,	0x00001000	@ TIM4_REMAP bit (TIM4 remapping)

