seradya/Lab1_Asm/Lab1_HelloWorld/Core/Asm/stm32l1xx.s
.equ	AFIO_MAPR_CAN_REMAP,	0x00006000	@ CAN_REMAP[1:0] bits (CAN Alternate function remapping)
.equ	AFIO_MAPR_CAN_REMAP_0,	0x00002000	@ Bit 0
.equ	AFIO_MAPR_CAN_REMAP_1,	0x00004000	@ Bit 1

@ CAN_REMAP configuration
.equ	AFIO_MAPR_CAN_REMAP_REMAP1,	0x00000000	@ CANRX mapped to PA11, CANTX mapped to PA12
.equ	AFIO_MAPR_CAN_REMAP_REMAP2,	0x00004000	@ CANRX mapped to PB8, CANTX mapped to PB9
.equ	AFIO_MAPR_CAN_REMAP_REMAP3,	0x00006000	@ CANRX mapped to PD0, CANTX mapped to PD1

.equ	AFIO_MAPR_PD01_REMAP,	0x00008000	@ Port D0/Port D1 mapping on OSC_IN/OSC_OUT
.equ	AFIO_MAPR_TIM5CH4_IREMAP,	0x00010000	@ TIM5 Channel4 Internal Remap
.equ	AFIO_MAPR_ADC1_ETRGINJ_REMAP,	0x00020000	@ ADC 1 External Trigger Injected Conversion remapping
.equ	AFIO_MAPR_ADC1_ETRGREG_REMAP,	0x00040000	@ ADC 1 External Trigger Regular Conversion remapping
.equ	AFIO_MAPR_ADC2_ETRGINJ_REMAP,	0x00080000	@ ADC 2 External Trigger Injected Conversion remapping
.equ	AFIO_MAPR_ADC2_ETRGREG_REMAP,	0x00100000	@ ADC 2 External Trigger Regular Conversion remapping

@ SWJ_CFG configuration
.equ	AFIO_MAPR_SWJ_CFG,	0x07000000	@ SWJ_CFG[2:0] bits (Serial Wire JTAG configuration)
.equ	AFIO_MAPR_SWJ_CFG_0,	0x01000000	@ Bit 0
.equ	AFIO_MAPR_SWJ_CFG_1,	0x02000000	@ Bit 1
.equ	AFIO_MAPR_SWJ_CFG_2,	0x04000000	@ Bit 2

.equ	AFIO_MAPR_SWJ_CFG_RESET,	0x00000000	@ Full SWJ (JTAG-DP + SW-DP) : Reset State
.equ	AFIO_MAPR_SWJ_CFG_NOJNTRST,	0x01000000	@ Full SWJ (JTAG-DP + SW-DP) but without JNTRST
.equ	AFIO_MAPR_SWJ_CFG_JTAGDISABLE,	0x02000000	@ JTAG-DP Disabled and SW-DP Enabled
.equ	AFIO_MAPR_SWJ_CFG_DISABLE,	0x04000000	@ JTAG-DP Disabled and SW-DP Disabled

.ifdef STM32F10X_CL
@ ETH_REMAP configuration
.equ	AFIO_MAPR_ETH_REMAP,	0x00200000	@ SPI3_REMAP bit (Ethernet MAC I/O remapping)

@ CAN2_REMAP configuration
.equ	AFIO_MAPR_CAN2_REMAP,	0x00400000	@ CAN2_REMAP bit (CAN2 I/O remapping)

@ MII_RMII_SEL configuration
.equ	AFIO_MAPR_MII_RMII_SEL,	0x00800000	@ MII_RMII_SEL bit (Ethernet MII or RMII selection)

@ SPI3_REMAP configuration
.equ	AFIO_MAPR_SPI3_REMAP,	0x10000000	@ SPI3_REMAP bit (SPI3 remapping)

@ TIM2ITR1_IREMAP configuration
.equ	AFIO_MAPR_TIM2ITR1_IREMAP,	0x20000000	@ TIM2ITR1_IREMAP bit (TIM2 internal trigger 1 remapping)

@ PTP_PPS_REMAP configuration
.equ	AFIO_MAPR_PTP_PPS_REMAP,	0x20000000	@ PTP_PPS_REMAP bit (Ethernet PTP PPS remapping)
.endif

@ Bit definition for AFIO_EXTICR1 register
.equ	AFIO_EXTICR1_EXTI0,	0x000F	@ EXTI 0 configuration
.equ	AFIO_EXTICR1_EXTI1,	0x00F0	@ EXTI 1 configuration
.equ	AFIO_EXTICR1_EXTI2,	0x0F00	@ EXTI 2 configuration
.equ	AFIO_EXTICR1_EXTI3,	0xF000	@ EXTI 3 configuration

@ EXTI0 configuration
.equ	AFIO_EXTICR1_EXTI0_PA,	0x0000	@ PA[0] pin
.equ	AFIO_EXTICR1_EXTI0_PB,	0x0001	@ PB[0] pin
.equ	AFIO_EXTICR1_EXTI0_PC,	0x0002	@ PC[0] pin
.equ	AFIO_EXTICR1_EXTI0_PD,	0x0003	@ PD[0] pin
.equ	AFIO_EXTICR1_EXTI0_PE,	0x0004	@ PE[0] pin
.equ	AFIO_EXTICR1_EXTI0_PF,	0x0005	@ PF[0] pin
.equ	AFIO_EXTICR1_EXTI0_PG,	0x0006	@ PG[0] pin

@ EXTI1 configuration
.equ	AFIO_EXTICR1_EXTI1_PA,	0x0000	@ PA[1] pin
.equ	AFIO_EXTICR1_EXTI1_PB,	0x0010	@ PB[1] pin
.equ	AFIO_EXTICR1_EXTI1_PC,	0x0020	@ PC[1] pin
.equ	AFIO_EXTICR1_EXTI1_PD,	0x0030	@ PD[1] pin
.equ	AFIO_EXTICR1_EXTI1_PE,	0x0040	@ PE[1] pin
.equ	AFIO_EXTICR1_EXTI1_PF,	0x0050	@ PF[1] pin
.equ	AFIO_EXTICR1_EXTI1_PG,	0x0060	@ PG[1] pin

@ EXTI2 configuration
.equ	AFIO_EXTICR1_EXTI2_PA,	0x0000	@ PA[2] pin
.equ	AFIO_EXTICR1_EXTI2_PB,	0x0100	@ PB[2] pin
.equ	AFIO_EXTICR1_EXTI2_PC,	0x0200	@ PC[2] pin
.equ	AFIO_EXTICR1_EXTI2_PD,	0x0300	@ PD[2] pin
.equ	AFIO_EXTICR1_EXTI2_PE,	0x0400	@ PE[2] pin
.equ	AFIO_EXTICR1_EXTI2_PF,	0x0500	@ PF[2] pin
.equ	AFIO_EXTICR1_EXTI2_PG,	0x0600	@ PG[2] pin

@ EXTI3 configuration
.equ	AFIO_EXTICR1_EXTI3_PA,	0x0000	@ PA[3] pin
.equ	AFIO_EXTICR1_EXTI3_PB,	0x1000	@ PB[3] pin
.equ	AFIO_EXTICR1_EXTI3_PC,	0x2000	@ PC[3] pin
.equ	AFIO_EXTICR1_EXTI3_PD,	0x3000	@ PD[3] pin
.equ	AFIO_EXTICR1_EXTI3_PE,	0x4000	@ PE[3] pin
.equ	AFIO_EXTICR1_EXTI3_PF,	0x5000	@ PF[3] pin
.equ	AFIO_EXTICR1_EXTI3_PG,	0x6000	@ PG[3] pin

@ Bit definition for AFIO_EXTICR2 register
.equ	AFIO_EXTICR2_EXTI4,	0x000F	@ EXTI 4 configuration
.equ	AFIO_EXTICR2_EXTI5,	0x00F0	@ EXTI 5 configuration
.equ	AFIO_EXTICR2_EXTI6,	0x0F00	@ EXTI 6 configuration
.equ	AFIO_EXTICR2_EXTI7,	0xF000	@ EXTI 7 configuration

@ EXTI4 configuration
.equ	AFIO_EXTICR2_EXTI4_PA,	0x0000	@ PA[4] pin
.equ	AFIO_EXTICR2_EXTI4_PB,	0x0001	@ PB[4] pin
.equ	AFIO_EXTICR2_EXTI4_PC,	0x0002	@ PC[4] pin
.equ	AFIO_EXTICR2_EXTI4_PD,	0x0003	@ PD[4] pin
.equ	AFIO_EXTICR2_EXTI4_PE,	0x0004	@ PE[4] pin
.equ	AFIO_EXTICR2_EXTI4_PF,	0x0005	@ PF[4] pin
.equ	AFIO_EXTICR2_EXTI4_PG,	0x0006	@ PG[4] pin

@ EXTI5 configuration
.equ	AFIO_EXTICR2_EXTI5_PA,	0x0000	@ PA[5] pin
.equ	AFIO_EXTICR2_EXTI5_PB,	0x0010	@ PB[5] pin
.equ	AFIO_EXTICR2_EXTI5_PC,	0x0020	@ PC[5] pin
.equ	AFIO_EXTICR2_EXTI5_PD,	0x0030	@ PD[5] pin
.equ	AFIO_EXTICR2_EXTI5_PE,	0x0040	@ PE[5] pin
.equ	AFIO_EXTICR2_EXTI5_PF,	0x0050	@ PF[5] pin
.equ	AFIO_EXTICR2_EXTI5_PG,	0x0060	@ PG[5] pin

@ EXTI6 configuration
.equ	AFIO_EXTICR2_EXTI6_PA,	0x0000	@ PA[6] pin
.equ	AFIO_EXTICR2_EXTI6_PB,	0x0100	@ PB[6] pin
.equ	AFIO_EXTICR2_EXTI6_PC,	0x0200	@ PC[6] pin
.equ	AFIO_EXTICR2_EXTI6_PD,	0x0300	@ PD[6] pin
.equ	AFIO_EXTICR2_EXTI6_PE,	0x0400	@ PE[6] pin
.equ	AFIO_EXTICR2_EXTI6_PF,	0x0500	@ PF[6] pin
.equ	AFIO_EXTICR2_EXTI6_PG,	0x0600	@ PG[6] pin

@ EXTI7 configuration
.equ	AFIO_EXTICR2_EXTI7_PA,	0x0000	@ PA[7] pin
.equ	AFIO_EXTICR2_EXTI7_PB,	0x1000	@ PB[7] pin
.equ	AFIO_EXTICR2_EXTI7_PC,	0x2000	@ PC[7] pin
.equ	AFIO_EXTICR2_EXTI7_PD,	0x3000	@ PD[7] pin
.equ	AFIO_EXTICR2_EXTI7_PE,	0x4000	@ PE[7] pin
.equ	AFIO_EXTICR2_EXTI7_PF,	0x5000	@ PF[7] pin
.equ	AFIO_EXTICR2_EXTI7_PG,	0x6000	@ PG[7] pin

@ Bit definition for AFIO_EXTICR3 register
.equ	AFIO_EXTICR3_EXTI8,	0x000F	@ EXTI 8 configuration
.equ	AFIO_EXTICR3_EXTI9,	0x00F0	@ EXTI 9 configuration
.equ	AFIO_EXTICR3_EXTI10,	0x0F00	@ EXTI 10 configuration
.equ	AFIO_EXTICR3_EXTI11,	0xF000	@ EXTI 11 configuration

@ EXTI8 configuration
.equ	AFIO_EXTICR3_EXTI8_PA,	0x0000	@ PA[8] pin
.equ	AFIO_EXTICR3_EXTI8_PB,	0x0001	@ PB[8] pin
.equ	AFIO_EXTICR3_EXTI8_PC,	0x0002	@ PC[8] pin
.equ	AFIO_EXTICR3_EXTI8_PD,	0x0003	@ PD[8] pin
.equ	AFIO_EXTICR3_EXTI8_PE,	0x0004	@ PE[8] pin
.equ	AFIO_EXTICR3_EXTI8_PF,	0x0005	@ PF[8] pin
.equ	AFIO_EXTICR3_EXTI8_PG,	0x0006	@ PG[8] pin

@ EXTI9 configuration
.equ	AFIO_EXTICR3_EXTI9_PA,	0x0000	@ PA[9] pin
.equ	AFIO_EXTICR3_EXTI9_PB,	0x0010	@ PB[9] pin
.equ	AFIO_EXTICR3_EXTI9_PC,	0x0020	@ PC[9] pin
.equ	AFIO_EXTICR3_EXTI9_PD,	0x0030	@ PD[9] pin
.equ	AFIO_EXTICR3_EXTI9_PE,	0x0040	@ PE[9] pin
.equ	AFIO_EXTICR3_EXTI9_PF,	0x0050	@ PF[9] pin
.equ	AFIO_EXTICR3_EXTI9_PG,	0x0060	@ PG[9] pin

