seradya/Lab1_Asm/Lab1_HelloWorld/Core/Asm/stm32l1xx.s
@ EXTI10 configuration
.equ	AFIO_EXTICR3_EXTI10_PA,	0x0000	@ PA[10] pin
.equ	AFIO_EXTICR3_EXTI10_PB,	0x0100	@ PB[10] pin
.equ	AFIO_EXTICR3_EXTI10_PC,	0x0200	@ PC[10] pin
.equ	AFIO_EXTICR3_EXTI10_PD,	0x0300	@ PD[10] pin
.equ	AFIO_EXTICR3_EXTI10_PE,	0x0400	@ PE[10] pin
.equ	AFIO_EXTICR3_EXTI10_PF,	0x0500	@ PF[10] pin
.equ	AFIO_EXTICR3_EXTI10_PG,	0x0600	@ PG[10] pin

@ EXTI11 configuration
.equ	AFIO_EXTICR3_EXTI11_PA,	0x0000	@ PA[11] pin
.equ	AFIO_EXTICR3_EXTI11_PB,	0x1000	@ PB[11] pin
.equ	AFIO_EXTICR3_EXTI11_PC,	0x2000	@ PC[11] pin
.equ	AFIO_EXTICR3_EXTI11_PD,	0x3000	@ PD[11] pin
.equ	AFIO_EXTICR3_EXTI11_PE,	0x4000	@ PE[11] pin
.equ	AFIO_EXTICR3_EXTI11_PF,	0x5000	@ PF[11] pin
.equ	AFIO_EXTICR3_EXTI11_PG,	0x6000	@ PG[11] pin

@ Bit definition for AFIO_EXTICR4 register
.equ	AFIO_EXTICR4_EXTI12,	0x000F	@ EXTI 12 configuration
.equ	AFIO_EXTICR4_EXTI13,	0x00F0	@ EXTI 13 configuration
.equ	AFIO_EXTICR4_EXTI14,	0x0F00	@ EXTI 14 configuration
.equ	AFIO_EXTICR4_EXTI15,	0xF000	@ EXTI 15 configuration

@ EXTI12 configuration
.equ	AFIO_EXTICR4_EXTI12_PA,	0x0000	@ PA[12] pin
.equ	AFIO_EXTICR4_EXTI12_PB,	0x0001	@ PB[12] pin
.equ	AFIO_EXTICR4_EXTI12_PC,	0x0002	@ PC[12] pin
.equ	AFIO_EXTICR4_EXTI12_PD,	0x0003	@ PD[12] pin
.equ	AFIO_EXTICR4_EXTI12_PE,	0x0004	@ PE[12] pin
.equ	AFIO_EXTICR4_EXTI12_PF,	0x0005	@ PF[12] pin
.equ	AFIO_EXTICR4_EXTI12_PG,	0x0006	@ PG[12] pin

@ EXTI13 configuration
.equ	AFIO_EXTICR4_EXTI13_PA,	0x0000	@ PA[13] pin
.equ	AFIO_EXTICR4_EXTI13_PB,	0x0010	@ PB[13] pin
.equ	AFIO_EXTICR4_EXTI13_PC,	0x0020	@ PC[13] pin
.equ	AFIO_EXTICR4_EXTI13_PD,	0x0030	@ PD[13] pin
.equ	AFIO_EXTICR4_EXTI13_PE,	0x0040	@ PE[13] pin
.equ	AFIO_EXTICR4_EXTI13_PF,	0x0050	@ PF[13] pin
.equ	AFIO_EXTICR4_EXTI13_PG,	0x0060	@ PG[13] pin

@ EXTI14 configuration
.equ	AFIO_EXTICR4_EXTI14_PA,	0x0000	@ PA[14] pin
.equ	AFIO_EXTICR4_EXTI14_PB,	0x0100	@ PB[14] pin
.equ	AFIO_EXTICR4_EXTI14_PC,	0x0200	@ PC[14] pin
.equ	AFIO_EXTICR4_EXTI14_PD,	0x0300	@ PD[14] pin
.equ	AFIO_EXTICR4_EXTI14_PE,	0x0400	@ PE[14] pin
.equ	AFIO_EXTICR4_EXTI14_PF,	0x0500	@ PF[14] pin
.equ	AFIO_EXTICR4_EXTI14_PG,	0x0600	@ PG[14] pin

@ EXTI15 configuration
.equ	AFIO_EXTICR4_EXTI15_PA,	0x0000	@ PA[15] pin
.equ	AFIO_EXTICR4_EXTI15_PB,	0x1000	@ PB[15] pin
.equ	AFIO_EXTICR4_EXTI15_PC,	0x2000	@ PC[15] pin
.equ	AFIO_EXTICR4_EXTI15_PD,	0x3000	@ PD[15] pin
.equ	AFIO_EXTICR4_EXTI15_PE,	0x4000	@ PE[15] pin
.equ	AFIO_EXTICR4_EXTI15_PF,	0x5000	@ PF[15] pin
.equ	AFIO_EXTICR4_EXTI15_PG,	0x6000	@ PG[15] pin


@
@ SystemTick
@


@ Bit definition for SysTick_CTRL register
.equ	SysTick_CTRL_ENABLE,	0x00000001	@ Counter enable
.equ	SysTick_CTRL_TICKINT,	0x00000002	@ Counting down to 0 pends the SysTick handler
.equ	SysTick_CTRL_CLKSOURCE,	0x00000004	@ Clock source
.equ	SysTick_CTRL_COUNTFLAG,	0x00010000	@ Count Flag

@ Bit definition for SysTick_LOAD register
.equ	SysTick_LOAD_RELOAD,	0x00FFFFFF	@ Value to load into the SysTick Current Value Register when the counter reaches 0

@ Bit definition for SysTick_VAL register
.equ	SysTick_VAL_CURRENT,	0x00FFFFFF	@ Current value at the time the register is accessed

@ Bit definition for SysTick_CALIB register
.equ	SysTick_CALIB_TENMS,	0x00FFFFFF	@ Reload value to use for 10ms timing
.equ	SysTick_CALIB_SKEW,	0x40000000	@ Calibration value is not exactly 10 ms
.equ	SysTick_CALIB_NOREF,	0x80000000	@ The reference clock is not provided


@
@ Nested Vectored Interrupt Controller
@


@ Bit definition for NVIC_ISER register
.equ	NVIC_ISER_SETENA,	0xFFFFFFFF	@ Interrupt set enable bits
.equ	NVIC_ISER_SETENA_0,	0x00000001	@ bit 0
.equ	NVIC_ISER_SETENA_1,	0x00000002	@ bit 1
.equ	NVIC_ISER_SETENA_2,	0x00000004	@ bit 2
.equ	NVIC_ISER_SETENA_3,	0x00000008	@ bit 3
.equ	NVIC_ISER_SETENA_4,	0x00000010	@ bit 4
.equ	NVIC_ISER_SETENA_5,	0x00000020	@ bit 5
.equ	NVIC_ISER_SETENA_6,	0x00000040	@ bit 6
.equ	NVIC_ISER_SETENA_7,	0x00000080	@ bit 7
.equ	NVIC_ISER_SETENA_8,	0x00000100	@ bit 8
.equ	NVIC_ISER_SETENA_9,	0x00000200	@ bit 9
.equ	NVIC_ISER_SETENA_10,	0x00000400	@ bit 10
.equ	NVIC_ISER_SETENA_11,	0x00000800	@ bit 11
.equ	NVIC_ISER_SETENA_12,	0x00001000	@ bit 12
.equ	NVIC_ISER_SETENA_13,	0x00002000	@ bit 13
.equ	NVIC_ISER_SETENA_14,	0x00004000	@ bit 14
.equ	NVIC_ISER_SETENA_15,	0x00008000	@ bit 15
.equ	NVIC_ISER_SETENA_16,	0x00010000	@ bit 16
.equ	NVIC_ISER_SETENA_17,	0x00020000	@ bit 17
.equ	NVIC_ISER_SETENA_18,	0x00040000	@ bit 18
.equ	NVIC_ISER_SETENA_19,	0x00080000	@ bit 19
.equ	NVIC_ISER_SETENA_20,	0x00100000	@ bit 20
.equ	NVIC_ISER_SETENA_21,	0x00200000	@ bit 21
.equ	NVIC_ISER_SETENA_22,	0x00400000	@ bit 22
.equ	NVIC_ISER_SETENA_23,	0x00800000	@ bit 23
.equ	NVIC_ISER_SETENA_24,	0x01000000	@ bit 24
.equ	NVIC_ISER_SETENA_25,	0x02000000	@ bit 25
.equ	NVIC_ISER_SETENA_26,	0x04000000	@ bit 26
.equ	NVIC_ISER_SETENA_27,	0x08000000	@ bit 27
.equ	NVIC_ISER_SETENA_28,	0x10000000	@ bit 28
.equ	NVIC_ISER_SETENA_29,	0x20000000	@ bit 29
.equ	NVIC_ISER_SETENA_30,	0x40000000	@ bit 30
.equ	NVIC_ISER_SETENA_31,	0x80000000	@ bit 31

@ Bit definition for NVIC_ICER register
.equ	NVIC_ICER_CLRENA,	0xFFFFFFFF	@ Interrupt clear-enable bits
.equ	NVIC_ICER_CLRENA_0,	0x00000001	@ bit 0
.equ	NVIC_ICER_CLRENA_1,	0x00000002	@ bit 1
.equ	NVIC_ICER_CLRENA_2,	0x00000004	@ bit 2
.equ	NVIC_ICER_CLRENA_3,	0x00000008	@ bit 3
.equ	NVIC_ICER_CLRENA_4,	0x00000010	@ bit 4
.equ	NVIC_ICER_CLRENA_5,	0x00000020	@ bit 5
.equ	NVIC_ICER_CLRENA_6,	0x00000040	@ bit 6
.equ	NVIC_ICER_CLRENA_7,	0x00000080	@ bit 7
.equ	NVIC_ICER_CLRENA_8,	0x00000100	@ bit 8
.equ	NVIC_ICER_CLRENA_9,	0x00000200	@ bit 9
.equ	NVIC_ICER_CLRENA_10,	0x00000400	@ bit 10
.equ	NVIC_ICER_CLRENA_11,	0x00000800	@ bit 11
.equ	NVIC_ICER_CLRENA_12,	0x00001000	@ bit 12
.equ	NVIC_ICER_CLRENA_13,	0x00002000	@ bit 13
.equ	NVIC_ICER_CLRENA_14,	0x00004000	@ bit 14
.equ	NVIC_ICER_CLRENA_15,	0x00008000	@ bit 15
.equ	NVIC_ICER_CLRENA_16,	0x00010000	@ bit 16
.equ	NVIC_ICER_CLRENA_17,	0x00020000	@ bit 17
.equ	NVIC_ICER_CLRENA_18,	0x00040000	@ bit 18
.equ	NVIC_ICER_CLRENA_19,	0x00080000	@ bit 19
.equ	NVIC_ICER_CLRENA_20,	0x00100000	@ bit 20
.equ	NVIC_ICER_CLRENA_21,	0x00200000	@ bit 21
.equ	NVIC_ICER_CLRENA_22,	0x00400000	@ bit 22
.equ	NVIC_ICER_CLRENA_23,	0x00800000	@ bit 23
.equ	NVIC_ICER_CLRENA_24,	0x01000000	@ bit 24
.equ	NVIC_ICER_CLRENA_25,	0x02000000	@ bit 25
.equ	NVIC_ICER_CLRENA_26,	0x04000000	@ bit 26
.equ	NVIC_ICER_CLRENA_27,	0x08000000	@ bit 27
.equ	NVIC_ICER_CLRENA_28,	0x10000000	@ bit 28
.equ	NVIC_ICER_CLRENA_29,	0x20000000	@ bit 29
.equ	NVIC_ICER_CLRENA_30,	0x40000000	@ bit 30
.equ	NVIC_ICER_CLRENA_31,	0x80000000	@ bit 31

@ Bit definition for NVIC_ISPR register
.equ	NVIC_ISPR_SETPEND,	0xFFFFFFFF	@ Interrupt set-pending bits
.equ	NVIC_ISPR_SETPEND_0,	0x00000001	@ bit 0
.equ	NVIC_ISPR_SETPEND_1,	0x00000002	@ bit 1
.equ	NVIC_ISPR_SETPEND_2,	0x00000004	@ bit 2
.equ	NVIC_ISPR_SETPEND_3,	0x00000008	@ bit 3
.equ	NVIC_ISPR_SETPEND_4,	0x00000010	@ bit 4
.equ	NVIC_ISPR_SETPEND_5,	0x00000020	@ bit 5
.equ	NVIC_ISPR_SETPEND_6,	0x00000040	@ bit 6
.equ	NVIC_ISPR_SETPEND_7,	0x00000080	@ bit 7
.equ	NVIC_ISPR_SETPEND_8,	0x00000100	@ bit 8
.equ	NVIC_ISPR_SETPEND_9,	0x00000200	@ bit 9
.equ	NVIC_ISPR_SETPEND_10,	0x00000400	@ bit 10
.equ	NVIC_ISPR_SETPEND_11,	0x00000800	@ bit 11
.equ	NVIC_ISPR_SETPEND_12,	0x00001000	@ bit 12
.equ	NVIC_ISPR_SETPEND_13,	0x00002000	@ bit 13
.equ	NVIC_ISPR_SETPEND_14,	0x00004000	@ bit 14
.equ	NVIC_ISPR_SETPEND_15,	0x00008000	@ bit 15
.equ	NVIC_ISPR_SETPEND_16,	0x00010000	@ bit 16
.equ	NVIC_ISPR_SETPEND_17,	0x00020000	@ bit 17
.equ	NVIC_ISPR_SETPEND_18,	0x00040000	@ bit 18
.equ	NVIC_ISPR_SETPEND_19,	0x00080000	@ bit 19
.equ	NVIC_ISPR_SETPEND_20,	0x00100000	@ bit 20
.equ	NVIC_ISPR_SETPEND_21,	0x00200000	@ bit 21
.equ	NVIC_ISPR_SETPEND_22,	0x00400000	@ bit 22
.equ	NVIC_ISPR_SETPEND_23,	0x00800000	@ bit 23
.equ	NVIC_ISPR_SETPEND_24,	0x01000000	@ bit 24
.equ	NVIC_ISPR_SETPEND_25,	0x02000000	@ bit 25
.equ	NVIC_ISPR_SETPEND_26,	0x04000000	@ bit 26
.equ	NVIC_ISPR_SETPEND_27,	0x08000000	@ bit 27
.equ	NVIC_ISPR_SETPEND_28,	0x10000000	@ bit 28
.equ	NVIC_ISPR_SETPEND_29,	0x20000000	@ bit 29
.equ	NVIC_ISPR_SETPEND_30,	0x40000000	@ bit 30
.equ	NVIC_ISPR_SETPEND_31,	0x80000000	@ bit 31

@ Bit definition for NVIC_ICPR register
.equ	NVIC_ICPR_CLRPEND,	0xFFFFFFFF	@ Interrupt clear-pending bits
.equ	NVIC_ICPR_CLRPEND_0,	0x00000001	@ bit 0
.equ	NVIC_ICPR_CLRPEND_1,	0x00000002	@ bit 1
.equ	NVIC_ICPR_CLRPEND_2,	0x00000004	@ bit 2
.equ	NVIC_ICPR_CLRPEND_3,	0x00000008	@ bit 3
.equ	NVIC_ICPR_CLRPEND_4,	0x00000010	@ bit 4
.equ	NVIC_ICPR_CLRPEND_5,	0x00000020	@ bit 5
.equ	NVIC_ICPR_CLRPEND_6,	0x00000040	@ bit 6
.equ	NVIC_ICPR_CLRPEND_7,	0x00000080	@ bit 7
.equ	NVIC_ICPR_CLRPEND_8,	0x00000100	@ bit 8
.equ	NVIC_ICPR_CLRPEND_9,	0x00000200	@ bit 9
.equ	NVIC_ICPR_CLRPEND_10,	0x00000400	@ bit 10
.equ	NVIC_ICPR_CLRPEND_11,	0x00000800	@ bit 11
.equ	NVIC_ICPR_CLRPEND_12,	0x00001000	@ bit 12
.equ	NVIC_ICPR_CLRPEND_13,	0x00002000	@ bit 13
.equ	NVIC_ICPR_CLRPEND_14,	0x00004000	@ bit 14
.equ	NVIC_ICPR_CLRPEND_15,	0x00008000	@ bit 15
.equ	NVIC_ICPR_CLRPEND_16,	0x00010000	@ bit 16
.equ	NVIC_ICPR_CLRPEND_17,	0x00020000	@ bit 17
.equ	NVIC_ICPR_CLRPEND_18,	0x00040000	@ bit 18
.equ	NVIC_ICPR_CLRPEND_19,	0x00080000	@ bit 19
.equ	NVIC_ICPR_CLRPEND_20,	0x00100000	@ bit 20
.equ	NVIC_ICPR_CLRPEND_21,	0x00200000	@ bit 21
.equ	NVIC_ICPR_CLRPEND_22,	0x00400000	@ bit 22
.equ	NVIC_ICPR_CLRPEND_23,	0x00800000	@ bit 23
.equ	NVIC_ICPR_CLRPEND_24,	0x01000000	@ bit 24
.equ	NVIC_ICPR_CLRPEND_25,	0x02000000	@ bit 25
.equ	NVIC_ICPR_CLRPEND_26,	0x04000000	@ bit 26
.equ	NVIC_ICPR_CLRPEND_27,	0x08000000	@ bit 27
.equ	NVIC_ICPR_CLRPEND_28,	0x10000000	@ bit 28
.equ	NVIC_ICPR_CLRPEND_29,	0x20000000	@ bit 29
.equ	NVIC_ICPR_CLRPEND_30,	0x40000000	@ bit 30
.equ	NVIC_ICPR_CLRPEND_31,	0x80000000	@ bit 31

@ Bit definition for NVIC_IABR register
.equ	NVIC_IABR_ACTIVE,	0xFFFFFFFF	@ Interrupt active flags
.equ	NVIC_IABR_ACTIVE_0,	0x00000001	@ bit 0
.equ	NVIC_IABR_ACTIVE_1,	0x00000002	@ bit 1
.equ	NVIC_IABR_ACTIVE_2,	0x00000004	@ bit 2
.equ	NVIC_IABR_ACTIVE_3,	0x00000008	@ bit 3
.equ	NVIC_IABR_ACTIVE_4,	0x00000010	@ bit 4
.equ	NVIC_IABR_ACTIVE_5,	0x00000020	@ bit 5
.equ	NVIC_IABR_ACTIVE_6,	0x00000040	@ bit 6
.equ	NVIC_IABR_ACTIVE_7,	0x00000080	@ bit 7
.equ	NVIC_IABR_ACTIVE_8,	0x00000100	@ bit 8
.equ	NVIC_IABR_ACTIVE_9,	0x00000200	@ bit 9
.equ	NVIC_IABR_ACTIVE_10,	0x00000400	@ bit 10
.equ	NVIC_IABR_ACTIVE_11,	0x00000800	@ bit 11
.equ	NVIC_IABR_ACTIVE_12,	0x00001000	@ bit 12
.equ	NVIC_IABR_ACTIVE_13,	0x00002000	@ bit 13
.equ	NVIC_IABR_ACTIVE_14,	0x00004000	@ bit 14
.equ	NVIC_IABR_ACTIVE_15,	0x00008000	@ bit 15
.equ	NVIC_IABR_ACTIVE_16,	0x00010000	@ bit 16
.equ	NVIC_IABR_ACTIVE_17,	0x00020000	@ bit 17
.equ	NVIC_IABR_ACTIVE_18,	0x00040000	@ bit 18
.equ	NVIC_IABR_ACTIVE_19,	0x00080000	@ bit 19
.equ	NVIC_IABR_ACTIVE_20,	0x00100000	@ bit 20
.equ	NVIC_IABR_ACTIVE_21,	0x00200000	@ bit 21
.equ	NVIC_IABR_ACTIVE_22,	0x00400000	@ bit 22
.equ	NVIC_IABR_ACTIVE_23,	0x00800000	@ bit 23
.equ	NVIC_IABR_ACTIVE_24,	0x01000000	@ bit 24
.equ	NVIC_IABR_ACTIVE_25,	0x02000000	@ bit 25
.equ	NVIC_IABR_ACTIVE_26,	0x04000000	@ bit 26
.equ	NVIC_IABR_ACTIVE_27,	0x08000000	@ bit 27
.equ	NVIC_IABR_ACTIVE_28,	0x10000000	@ bit 28
.equ	NVIC_IABR_ACTIVE_29,	0x20000000	@ bit 29
.equ	NVIC_IABR_ACTIVE_30,	0x40000000	@ bit 30
.equ	NVIC_IABR_ACTIVE_31,	0x80000000	@ bit 31

