seradya/Lab1_Asm/Lab1_HelloWorld/Core/Asm/stm32l1xx.s
@ Bit definition for EXTI_RTSR register
.equ	EXTI_RTSR_TR0,	0x00000001	@ Rising trigger event configuration bit of line 0
.equ	EXTI_RTSR_TR1,	0x00000002	@ Rising trigger event configuration bit of line 1
.equ	EXTI_RTSR_TR2,	0x00000004	@ Rising trigger event configuration bit of line 2
.equ	EXTI_RTSR_TR3,	0x00000008	@ Rising trigger event configuration bit of line 3
.equ	EXTI_RTSR_TR4,	0x00000010	@ Rising trigger event configuration bit of line 4
.equ	EXTI_RTSR_TR5,	0x00000020	@ Rising trigger event configuration bit of line 5
.equ	EXTI_RTSR_TR6,	0x00000040	@ Rising trigger event configuration bit of line 6
.equ	EXTI_RTSR_TR7,	0x00000080	@ Rising trigger event configuration bit of line 7
.equ	EXTI_RTSR_TR8,	0x00000100	@ Rising trigger event configuration bit of line 8
.equ	EXTI_RTSR_TR9,	0x00000200	@ Rising trigger event configuration bit of line 9
.equ	EXTI_RTSR_TR10,	0x00000400	@ Rising trigger event configuration bit of line 10
.equ	EXTI_RTSR_TR11,	0x00000800	@ Rising trigger event configuration bit of line 11
.equ	EXTI_RTSR_TR12,	0x00001000	@ Rising trigger event configuration bit of line 12
.equ	EXTI_RTSR_TR13,	0x00002000	@ Rising trigger event configuration bit of line 13
.equ	EXTI_RTSR_TR14,	0x00004000	@ Rising trigger event configuration bit of line 14
.equ	EXTI_RTSR_TR15,	0x00008000	@ Rising trigger event configuration bit of line 15
.equ	EXTI_RTSR_TR16,	0x00010000	@ Rising trigger event configuration bit of line 16
.equ	EXTI_RTSR_TR17,	0x00020000	@ Rising trigger event configuration bit of line 17
.equ	EXTI_RTSR_TR18,	0x00040000	@ Rising trigger event configuration bit of line 18
.equ	EXTI_RTSR_TR19,	0x00080000	@ Rising trigger event configuration bit of line 19

@ Bit definition for EXTI_FTSR register
.equ	EXTI_FTSR_TR0,	0x00000001	@ Falling trigger event configuration bit of line 0
.equ	EXTI_FTSR_TR1,	0x00000002	@ Falling trigger event configuration bit of line 1
.equ	EXTI_FTSR_TR2,	0x00000004	@ Falling trigger event configuration bit of line 2
.equ	EXTI_FTSR_TR3,	0x00000008	@ Falling trigger event configuration bit of line 3
.equ	EXTI_FTSR_TR4,	0x00000010	@ Falling trigger event configuration bit of line 4
.equ	EXTI_FTSR_TR5,	0x00000020	@ Falling trigger event configuration bit of line 5
.equ	EXTI_FTSR_TR6,	0x00000040	@ Falling trigger event configuration bit of line 6
.equ	EXTI_FTSR_TR7,	0x00000080	@ Falling trigger event configuration bit of line 7
.equ	EXTI_FTSR_TR8,	0x00000100	@ Falling trigger event configuration bit of line 8
.equ	EXTI_FTSR_TR9,	0x00000200	@ Falling trigger event configuration bit of line 9
.equ	EXTI_FTSR_TR10,	0x00000400	@ Falling trigger event configuration bit of line 10
.equ	EXTI_FTSR_TR11,	0x00000800	@ Falling trigger event configuration bit of line 11
.equ	EXTI_FTSR_TR12,	0x00001000	@ Falling trigger event configuration bit of line 12
.equ	EXTI_FTSR_TR13,	0x00002000	@ Falling trigger event configuration bit of line 13
.equ	EXTI_FTSR_TR14,	0x00004000	@ Falling trigger event configuration bit of line 14
.equ	EXTI_FTSR_TR15,	0x00008000	@ Falling trigger event configuration bit of line 15
.equ	EXTI_FTSR_TR16,	0x00010000	@ Falling trigger event configuration bit of line 16
.equ	EXTI_FTSR_TR17,	0x00020000	@ Falling trigger event configuration bit of line 17
.equ	EXTI_FTSR_TR18,	0x00040000	@ Falling trigger event configuration bit of line 18
.equ	EXTI_FTSR_TR19,	0x00080000	@ Falling trigger event configuration bit of line 19

@ Bit definition for EXTI_SWIER register
.equ	EXTI_SWIER_SWIER0,	0x00000001	@ Software Interrupt on line 0
.equ	EXTI_SWIER_SWIER1,	0x00000002	@ Software Interrupt on line 1
.equ	EXTI_SWIER_SWIER2,	0x00000004	@ Software Interrupt on line 2
.equ	EXTI_SWIER_SWIER3,	0x00000008	@ Software Interrupt on line 3
.equ	EXTI_SWIER_SWIER4,	0x00000010	@ Software Interrupt on line 4
.equ	EXTI_SWIER_SWIER5,	0x00000020	@ Software Interrupt on line 5
.equ	EXTI_SWIER_SWIER6,	0x00000040	@ Software Interrupt on line 6
.equ	EXTI_SWIER_SWIER7,	0x00000080	@ Software Interrupt on line 7
.equ	EXTI_SWIER_SWIER8,	0x00000100	@ Software Interrupt on line 8
.equ	EXTI_SWIER_SWIER9,	0x00000200	@ Software Interrupt on line 9
.equ	EXTI_SWIER_SWIER10,	0x00000400	@ Software Interrupt on line 10
.equ	EXTI_SWIER_SWIER11,	0x00000800	@ Software Interrupt on line 11
.equ	EXTI_SWIER_SWIER12,	0x00001000	@ Software Interrupt on line 12
.equ	EXTI_SWIER_SWIER13,	0x00002000	@ Software Interrupt on line 13
.equ	EXTI_SWIER_SWIER14,	0x00004000	@ Software Interrupt on line 14
.equ	EXTI_SWIER_SWIER15,	0x00008000	@ Software Interrupt on line 15
.equ	EXTI_SWIER_SWIER16,	0x00010000	@ Software Interrupt on line 16
.equ	EXTI_SWIER_SWIER17,	0x00020000	@ Software Interrupt on line 17
.equ	EXTI_SWIER_SWIER18,	0x00040000	@ Software Interrupt on line 18
.equ	EXTI_SWIER_SWIER19,	0x00080000	@ Software Interrupt on line 19

@ Bit definition for EXTI_PR register
.equ	EXTI_PR_PR0,	0x00000001	@ Pending bit for line 0
.equ	EXTI_PR_PR1,	0x00000002	@ Pending bit for line 1
.equ	EXTI_PR_PR2,	0x00000004	@ Pending bit for line 2
.equ	EXTI_PR_PR3,	0x00000008	@ Pending bit for line 3
.equ	EXTI_PR_PR4,	0x00000010	@ Pending bit for line 4
.equ	EXTI_PR_PR5,	0x00000020	@ Pending bit for line 5
.equ	EXTI_PR_PR6,	0x00000040	@ Pending bit for line 6
.equ	EXTI_PR_PR7,	0x00000080	@ Pending bit for line 7
.equ	EXTI_PR_PR8,	0x00000100	@ Pending bit for line 8
.equ	EXTI_PR_PR9,	0x00000200	@ Pending bit for line 9
.equ	EXTI_PR_PR10,	0x00000400	@ Pending bit for line 10
.equ	EXTI_PR_PR11,	0x00000800	@ Pending bit for line 11
.equ	EXTI_PR_PR12,	0x00001000	@ Pending bit for line 12
.equ	EXTI_PR_PR13,	0x00002000	@ Pending bit for line 13
.equ	EXTI_PR_PR14,	0x00004000	@ Pending bit for line 14
.equ	EXTI_PR_PR15,	0x00008000	@ Pending bit for line 15
.equ	EXTI_PR_PR16,	0x00010000	@ Pending bit for line 16
.equ	EXTI_PR_PR17,	0x00020000	@ Pending bit for line 17
.equ	EXTI_PR_PR18,	0x00040000	@ Pending bit for line 18
.equ	EXTI_PR_PR19,	0x00080000	@ Pending bit for line 19


@
@ DMA Controller
@


@ Bit definition for DMA_ISR register
.equ	DMA_ISR_GIF1,	0x00000001	@ Channel 1 Global interrupt flag
.equ	DMA_ISR_TCIF1,	0x00000002	@ Channel 1 Transfer Complete flag
.equ	DMA_ISR_HTIF1,	0x00000004	@ Channel 1 Half Transfer flag
.equ	DMA_ISR_TEIF1,	0x00000008	@ Channel 1 Transfer Error flag
.equ	DMA_ISR_GIF2,	0x00000010	@ Channel 2 Global interrupt flag
.equ	DMA_ISR_TCIF2,	0x00000020	@ Channel 2 Transfer Complete flag
.equ	DMA_ISR_HTIF2,	0x00000040	@ Channel 2 Half Transfer flag
.equ	DMA_ISR_TEIF2,	0x00000080	@ Channel 2 Transfer Error flag
.equ	DMA_ISR_GIF3,	0x00000100	@ Channel 3 Global interrupt flag
.equ	DMA_ISR_TCIF3,	0x00000200	@ Channel 3 Transfer Complete flag
.equ	DMA_ISR_HTIF3,	0x00000400	@ Channel 3 Half Transfer flag
.equ	DMA_ISR_TEIF3,	0x00000800	@ Channel 3 Transfer Error flag
.equ	DMA_ISR_GIF4,	0x00001000	@ Channel 4 Global interrupt flag
.equ	DMA_ISR_TCIF4,	0x00002000	@ Channel 4 Transfer Complete flag
.equ	DMA_ISR_HTIF4,	0x00004000	@ Channel 4 Half Transfer flag
.equ	DMA_ISR_TEIF4,	0x00008000	@ Channel 4 Transfer Error flag
.equ	DMA_ISR_GIF5,	0x00010000	@ Channel 5 Global interrupt flag
.equ	DMA_ISR_TCIF5,	0x00020000	@ Channel 5 Transfer Complete flag
.equ	DMA_ISR_HTIF5,	0x00040000	@ Channel 5 Half Transfer flag
.equ	DMA_ISR_TEIF5,	0x00080000	@ Channel 5 Transfer Error flag
.equ	DMA_ISR_GIF6,	0x00100000	@ Channel 6 Global interrupt flag
.equ	DMA_ISR_TCIF6,	0x00200000	@ Channel 6 Transfer Complete flag
.equ	DMA_ISR_HTIF6,	0x00400000	@ Channel 6 Half Transfer flag
.equ	DMA_ISR_TEIF6,	0x00800000	@ Channel 6 Transfer Error flag
.equ	DMA_ISR_GIF7,	0x01000000	@ Channel 7 Global interrupt flag
.equ	DMA_ISR_TCIF7,	0x02000000	@ Channel 7 Transfer Complete flag
.equ	DMA_ISR_HTIF7,	0x04000000	@ Channel 7 Half Transfer flag
.equ	DMA_ISR_TEIF7,	0x08000000	@ Channel 7 Transfer Error flag

@ Bit definition for DMA_IFCR register
.equ	DMA_IFCR_CGIF1,	0x00000001	@ Channel 1 Global interrupt clearr
.equ	DMA_IFCR_CTCIF1,	0x00000002	@ Channel 1 Transfer Complete clear
.equ	DMA_IFCR_CHTIF1,	0x00000004	@ Channel 1 Half Transfer clear
.equ	DMA_IFCR_CTEIF1,	0x00000008	@ Channel 1 Transfer Error clear
.equ	DMA_IFCR_CGIF2,	0x00000010	@ Channel 2 Global interrupt clear
.equ	DMA_IFCR_CTCIF2,	0x00000020	@ Channel 2 Transfer Complete clear
.equ	DMA_IFCR_CHTIF2,	0x00000040	@ Channel 2 Half Transfer clear
.equ	DMA_IFCR_CTEIF2,	0x00000080	@ Channel 2 Transfer Error clear
.equ	DMA_IFCR_CGIF3,	0x00000100	@ Channel 3 Global interrupt clear
.equ	DMA_IFCR_CTCIF3,	0x00000200	@ Channel 3 Transfer Complete clear
.equ	DMA_IFCR_CHTIF3,	0x00000400	@ Channel 3 Half Transfer clear
.equ	DMA_IFCR_CTEIF3,	0x00000800	@ Channel 3 Transfer Error clear
.equ	DMA_IFCR_CGIF4,	0x00001000	@ Channel 4 Global interrupt clear
.equ	DMA_IFCR_CTCIF4,	0x00002000	@ Channel 4 Transfer Complete clear
.equ	DMA_IFCR_CHTIF4,	0x00004000	@ Channel 4 Half Transfer clear
.equ	DMA_IFCR_CTEIF4,	0x00008000	@ Channel 4 Transfer Error clear
.equ	DMA_IFCR_CGIF5,	0x00010000	@ Channel 5 Global interrupt clear
.equ	DMA_IFCR_CTCIF5,	0x00020000	@ Channel 5 Transfer Complete clear
.equ	DMA_IFCR_CHTIF5,	0x00040000	@ Channel 5 Half Transfer clear
.equ	DMA_IFCR_CTEIF5,	0x00080000	@ Channel 5 Transfer Error clear
.equ	DMA_IFCR_CGIF6,	0x00100000	@ Channel 6 Global interrupt clear
.equ	DMA_IFCR_CTCIF6,	0x00200000	@ Channel 6 Transfer Complete clear
.equ	DMA_IFCR_CHTIF6,	0x00400000	@ Channel 6 Half Transfer clear
.equ	DMA_IFCR_CTEIF6,	0x00800000	@ Channel 6 Transfer Error clear
.equ	DMA_IFCR_CGIF7,	0x01000000	@ Channel 7 Global interrupt clear
.equ	DMA_IFCR_CTCIF7,	0x02000000	@ Channel 7 Transfer Complete clear
.equ	DMA_IFCR_CHTIF7,	0x04000000	@ Channel 7 Half Transfer clear
.equ	DMA_IFCR_CTEIF7,	0x08000000	@ Channel 7 Transfer Error clear

@ Bit definition for DMA_CCR1 register
.equ	DMA_CCR1_EN,	0x0001	@ Channel enable
.equ	DMA_CCR1_TCIE,	0x0002	@ Transfer complete interrupt enable
.equ	DMA_CCR1_HTIE,	0x0004	@ Half Transfer interrupt enable
.equ	DMA_CCR1_TEIE,	0x0008	@ Transfer error interrupt enable
.equ	DMA_CCR1_DIR,	0x0010	@ Data transfer direction
.equ	DMA_CCR1_CIRC,	0x0020	@ Circular mode
.equ	DMA_CCR1_PINC,	0x0040	@ Peripheral increment mode
.equ	DMA_CCR1_MINC,	0x0080	@ Memory increment mode

