seradya/Lab1_Asm/Lab1_HelloWorld/Core/Asm/stm32l1xx.s
.equ	DMA_CCR1_PSIZE,	0x0300	@ PSIZE[1:0] bits (Peripheral size)
.equ	DMA_CCR1_PSIZE_0,	0x0100	@ Bit 0
.equ	DMA_CCR1_PSIZE_1,	0x0200	@ Bit 1

.equ	DMA_CCR1_MSIZE,	0x0C00	@ MSIZE[1:0] bits (Memory size)
.equ	DMA_CCR1_MSIZE_0,	0x0400	@ Bit 0
.equ	DMA_CCR1_MSIZE_1,	0x0800	@ Bit 1

.equ	DMA_CCR1_PL,	0x3000	@ PL[1:0] bits(Channel Priority level)
.equ	DMA_CCR1_PL_0,	0x1000	@ Bit 0
.equ	DMA_CCR1_PL_1,	0x2000	@ Bit 1

.equ	DMA_CCR1_MEM2MEM,	0x4000	@ Memory to memory mode

@ Bit definition for DMA_CCR2 register
.equ	DMA_CCR2_EN,	0x0001	@ Channel enable
.equ	DMA_CCR2_TCIE,	0x0002	@ ransfer complete interrupt enable
.equ	DMA_CCR2_HTIE,	0x0004	@ Half Transfer interrupt enable
.equ	DMA_CCR2_TEIE,	0x0008	@ Transfer error interrupt enable
.equ	DMA_CCR2_DIR,	0x0010	@ Data transfer direction
.equ	DMA_CCR2_CIRC,	0x0020	@ Circular mode
.equ	DMA_CCR2_PINC,	0x0040	@ Peripheral increment mode
.equ	DMA_CCR2_MINC,	0x0080	@ Memory increment mode

.equ	DMA_CCR2_PSIZE,	0x0300	@ PSIZE[1:0] bits (Peripheral size)
.equ	DMA_CCR2_PSIZE_0,	0x0100	@ Bit 0
.equ	DMA_CCR2_PSIZE_1,	0x0200	@ Bit 1

.equ	DMA_CCR2_MSIZE,	0x0C00	@ MSIZE[1:0] bits (Memory size)
.equ	DMA_CCR2_MSIZE_0,	0x0400	@ Bit 0
.equ	DMA_CCR2_MSIZE_1,	0x0800	@ Bit 1

.equ	DMA_CCR2_PL,	0x3000	@ PL[1:0] bits (Channel Priority level)
.equ	DMA_CCR2_PL_0,	0x1000	@ Bit 0
.equ	DMA_CCR2_PL_1,	0x2000	@ Bit 1

.equ	DMA_CCR2_MEM2MEM,	0x4000	@ Memory to memory mode

@ Bit definition for DMA_CCR3 register
.equ	DMA_CCR3_EN,	0x0001	@ Channel enable
.equ	DMA_CCR3_TCIE,	0x0002	@ Transfer complete interrupt enable
.equ	DMA_CCR3_HTIE,	0x0004	@ Half Transfer interrupt enable
.equ	DMA_CCR3_TEIE,	0x0008	@ Transfer error interrupt enable
.equ	DMA_CCR3_DIR,	0x0010	@ Data transfer direction
.equ	DMA_CCR3_CIRC,	0x0020	@ Circular mode
.equ	DMA_CCR3_PINC,	0x0040	@ Peripheral increment mode
.equ	DMA_CCR3_MINC,	0x0080	@ Memory increment mode

.equ	DMA_CCR3_PSIZE,	0x0300	@ PSIZE[1:0] bits (Peripheral size)
.equ	DMA_CCR3_PSIZE_0,	0x0100	@ Bit 0
.equ	DMA_CCR3_PSIZE_1,	0x0200	@ Bit 1

.equ	DMA_CCR3_MSIZE,	0x0C00	@ MSIZE[1:0] bits (Memory size)
.equ	DMA_CCR3_MSIZE_0,	0x0400	@ Bit 0
.equ	DMA_CCR3_MSIZE_1,	0x0800	@ Bit 1

.equ	DMA_CCR3_PL,	0x3000	@ PL[1:0] bits (Channel Priority level)
.equ	DMA_CCR3_PL_0,	0x1000	@ Bit 0
.equ	DMA_CCR3_PL_1,	0x2000	@ Bit 1

.equ	DMA_CCR3_MEM2MEM,	0x4000	@ Memory to memory mode

@ * Bit definition for DMA_CCR4 register
.equ	DMA_CCR4_EN,	0x0001	@ Channel enable
.equ	DMA_CCR4_TCIE,	0x0002	@ Transfer complete interrupt enable
.equ	DMA_CCR4_HTIE,	0x0004	@ Half Transfer interrupt enable
.equ	DMA_CCR4_TEIE,	0x0008	@ Transfer error interrupt enable
.equ	DMA_CCR4_DIR,	0x0010	@ Data transfer direction
.equ	DMA_CCR4_CIRC,	0x0020	@ Circular mode
.equ	DMA_CCR4_PINC,	0x0040	@ Peripheral increment mode
.equ	DMA_CCR4_MINC,	0x0080	@ Memory increment mode

.equ	DMA_CCR4_PSIZE,	0x0300	@ PSIZE[1:0] bits (Peripheral size)
.equ	DMA_CCR4_PSIZE_0,	0x0100	@ Bit 0
.equ	DMA_CCR4_PSIZE_1,	0x0200	@ Bit 1

.equ	DMA_CCR4_MSIZE,	0x0C00	@ MSIZE[1:0] bits (Memory size)
.equ	DMA_CCR4_MSIZE_0,	0x0400	@ Bit 0
.equ	DMA_CCR4_MSIZE_1,	0x0800	@ Bit 1

.equ	DMA_CCR4_PL,	0x3000	@ PL[1:0] bits (Channel Priority level)
.equ	DMA_CCR4_PL_0,	0x1000	@ Bit 0
.equ	DMA_CCR4_PL_1,	0x2000	@ Bit 1

.equ	DMA_CCR4_MEM2MEM,	0x4000	@ Memory to memory mode

@ Bit definition for DMA_CCR5 register
.equ	DMA_CCR5_EN,	0x0001	@ Channel enable
.equ	DMA_CCR5_TCIE,	0x0002	@ Transfer complete interrupt enable
.equ	DMA_CCR5_HTIE,	0x0004	@ Half Transfer interrupt enable
.equ	DMA_CCR5_TEIE,	0x0008	@ Transfer error interrupt enable
.equ	DMA_CCR5_DIR,	0x0010	@ Data transfer direction
.equ	DMA_CCR5_CIRC,	0x0020	@ Circular mode
.equ	DMA_CCR5_PINC,	0x0040	@ Peripheral increment mode
.equ	DMA_CCR5_MINC,	0x0080	@ Memory increment mode

.equ	DMA_CCR5_PSIZE,	0x0300	@ PSIZE[1:0] bits (Peripheral size)
.equ	DMA_CCR5_PSIZE_0,	0x0100	@ Bit 0
.equ	DMA_CCR5_PSIZE_1,	0x0200	@ Bit 1

.equ	DMA_CCR5_MSIZE,	0x0C00	@ MSIZE[1:0] bits (Memory size)
.equ	DMA_CCR5_MSIZE_0,	0x0400	@ Bit 0
.equ	DMA_CCR5_MSIZE_1,	0x0800	@ Bit 1

.equ	DMA_CCR5_PL,	0x3000	@ PL[1:0] bits (Channel Priority level)
.equ	DMA_CCR5_PL_0,	0x1000	@ Bit 0
.equ	DMA_CCR5_PL_1,	0x2000	@ Bit 1

.equ	DMA_CCR5_MEM2MEM,	0x4000	@ Memory to memory mode enable

@ Bit definition for DMA_CCR6 register
.equ	DMA_CCR6_EN,	0x0001	@ Channel enable
.equ	DMA_CCR6_TCIE,	0x0002	@ Transfer complete interrupt enable
.equ	DMA_CCR6_HTIE,	0x0004	@ Half Transfer interrupt enable
.equ	DMA_CCR6_TEIE,	0x0008	@ Transfer error interrupt enable
.equ	DMA_CCR6_DIR,	0x0010	@ Data transfer direction
.equ	DMA_CCR6_CIRC,	0x0020	@ Circular mode
.equ	DMA_CCR6_PINC,	0x0040	@ Peripheral increment mode
.equ	DMA_CCR6_MINC,	0x0080	@ Memory increment mode

.equ	DMA_CCR6_PSIZE,	0x0300	@ PSIZE[1:0] bits (Peripheral size)
.equ	DMA_CCR6_PSIZE_0,	0x0100	@ Bit 0
.equ	DMA_CCR6_PSIZE_1,	0x0200	@ Bit 1

.equ	DMA_CCR6_MSIZE,	0x0C00	@ MSIZE[1:0] bits (Memory size)
.equ	DMA_CCR6_MSIZE_0,	0x0400	@ Bit 0
.equ	DMA_CCR6_MSIZE_1,	0x0800	@ Bit 1

.equ	DMA_CCR6_PL,	0x3000	@ PL[1:0] bits (Channel Priority level)
.equ	DMA_CCR6_PL_0,	0x1000	@ Bit 0
.equ	DMA_CCR6_PL_1,	0x2000	@ Bit 1

.equ	DMA_CCR6_MEM2MEM,	0x4000	@ Memory to memory mode

@ Bit definition for DMA_CCR7 register
.equ	DMA_CCR7_EN,	0x0001	@ Channel enable
.equ	DMA_CCR7_TCIE,	0x0002	@ Transfer complete interrupt enable
.equ	DMA_CCR7_HTIE,	0x0004	@ Half Transfer interrupt enable
.equ	DMA_CCR7_TEIE,	0x0008	@ Transfer error interrupt enable
.equ	DMA_CCR7_DIR,	0x0010	@ Data transfer direction
.equ	DMA_CCR7_CIRC,	0x0020	@ Circular mode
.equ	DMA_CCR7_PINC,	0x0040	@ Peripheral increment mode
.equ	DMA_CCR7_MINC,	0x0080	@ Memory increment mode

.equ	DMA_CCR7_PSIZE,	0x0300	@ PSIZE[1:0] bits (Peripheral size)
.equ	DMA_CCR7_PSIZE_0,	0x0100	@ Bit 0
.equ	DMA_CCR7_PSIZE_1,	0x0200	@ Bit 1

.equ	DMA_CCR7_MSIZE,	0x0C00	@ MSIZE[1:0] bits (Memory size)
.equ	DMA_CCR7_MSIZE_0,	0x0400	@ Bit 0
.equ	DMA_CCR7_MSIZE_1,	0x0800	@ Bit 1

.equ	DMA_CCR7_PL,	0x3000	@ PL[1:0] bits (Channel Priority level)
.equ	DMA_CCR7_PL_0,	0x1000	@ Bit 0
.equ	DMA_CCR7_PL_1,	0x2000	@ Bit 1

.equ	DMA_CCR7_MEM2MEM,	0x4000	@ Memory to memory mode enable

@ Bit definition for DMA_CNDTR1 register
.equ	DMA_CNDTR1_NDT,	0xFFFF	@ Number of data to Transfer

