seradya/Lab1_Asm/Lab1_HelloWorld/Core/Asm/stm32l1xx.s
@ Bit definition for ADC_JSQR register
.equ	ADC_JSQR_JSQ1,	0x0000001F	@ JSQ1[4:0] bits (1st conversion in injected sequence)
.equ	ADC_JSQR_JSQ1_0,	0x00000001	@ Bit 0
.equ	ADC_JSQR_JSQ1_1,	0x00000002	@ Bit 1
.equ	ADC_JSQR_JSQ1_2,	0x00000004	@ Bit 2
.equ	ADC_JSQR_JSQ1_3,	0x00000008	@ Bit 3
.equ	ADC_JSQR_JSQ1_4,	0x00000010	@ Bit 4

.equ	ADC_JSQR_JSQ2,	0x000003E0	@ JSQ2[4:0] bits (2nd conversion in injected sequence)
.equ	ADC_JSQR_JSQ2_0,	0x00000020	@ Bit 0
.equ	ADC_JSQR_JSQ2_1,	0x00000040	@ Bit 1
.equ	ADC_JSQR_JSQ2_2,	0x00000080	@ Bit 2
.equ	ADC_JSQR_JSQ2_3,	0x00000100	@ Bit 3
.equ	ADC_JSQR_JSQ2_4,	0x00000200	@ Bit 4

.equ	ADC_JSQR_JSQ3,	0x00007C00	@ JSQ3[4:0] bits (3rd conversion in injected sequence)
.equ	ADC_JSQR_JSQ3_0,	0x00000400	@ Bit 0
.equ	ADC_JSQR_JSQ3_1,	0x00000800	@ Bit 1
.equ	ADC_JSQR_JSQ3_2,	0x00001000	@ Bit 2
.equ	ADC_JSQR_JSQ3_3,	0x00002000	@ Bit 3
.equ	ADC_JSQR_JSQ3_4,	0x00004000	@ Bit 4

.equ	ADC_JSQR_JSQ4,	0x000F8000	@ JSQ4[4:0] bits (4th conversion in injected sequence)
.equ	ADC_JSQR_JSQ4_0,	0x00008000	@ Bit 0
.equ	ADC_JSQR_JSQ4_1,	0x00010000	@ Bit 1
.equ	ADC_JSQR_JSQ4_2,	0x00020000	@ Bit 2
.equ	ADC_JSQR_JSQ4_3,	0x00040000	@ Bit 3
.equ	ADC_JSQR_JSQ4_4,	0x00080000	@ Bit 4

.equ	ADC_JSQR_JL,	0x00300000	@ JL[1:0] bits (Injected Sequence length)
.equ	ADC_JSQR_JL_0,	0x00100000	@ Bit 0
.equ	ADC_JSQR_JL_1,	0x00200000	@ Bit 1

@ Bit definition for ADC_JDR1 register
.equ	ADC_JDR1_JDATA,	0xFFFF	@ Injected data

@ Bit definition for ADC_JDR2 register
.equ	ADC_JDR2_JDATA,	0xFFFF	@ Injected data

@ Bit definition for ADC_JDR3 register
.equ	ADC_JDR3_JDATA,	0xFFFF	@ Injected data

@ Bit definition for ADC_JDR4 register
.equ	ADC_JDR4_JDATA,	0xFFFF	@ Injected data

@ Bit definition for ADC_DR register
.equ	ADC_DR_DATA,	0x0000FFFF	@ Regular data
.equ	ADC_DR_ADC2DATA,	0xFFFF0000	@ ADC2 data


@
@ Digital to Analog Converter
@


@ Bit definition for DAC_CR register
.equ	DAC_CR_EN1,	0x00000001	@ DAC channel1 enable
.equ	DAC_CR_BOFF1,	0x00000002	@ DAC channel1 output buffer disable
.equ	DAC_CR_TEN1,	0x00000004	@ DAC channel1 Trigger enable

.equ	DAC_CR_TSEL1,	0x00000038	@ TSEL1[2:0] (DAC channel1 Trigger selection)
.equ	DAC_CR_TSEL1_0,	0x00000008	@ Bit 0
.equ	DAC_CR_TSEL1_1,	0x00000010	@ Bit 1
.equ	DAC_CR_TSEL1_2,	0x00000020	@ Bit 2

.equ	DAC_CR_WAVE1,	0x000000C0	@ WAVE1[1:0] (DAC channel1 noise/triangle wave generation enable)
.equ	DAC_CR_WAVE1_0,	0x00000040	@ Bit 0
.equ	DAC_CR_WAVE1_1,	0x00000080	@ Bit 1

.equ	DAC_CR_MAMP1,	0x00000F00	@ MAMP1[3:0] (DAC channel1 Mask/Amplitude selector)
.equ	DAC_CR_MAMP1_0,	0x00000100	@ Bit 0
.equ	DAC_CR_MAMP1_1,	0x00000200	@ Bit 1
.equ	DAC_CR_MAMP1_2,	0x00000400	@ Bit 2
.equ	DAC_CR_MAMP1_3,	0x00000800	@ Bit 3

.equ	DAC_CR_DMAEN1,	0x00001000	@ DAC channel1 DMA enable
.equ	DAC_CR_EN2,	0x00010000	@ DAC channel2 enable
.equ	DAC_CR_BOFF2,	0x00020000	@ DAC channel2 output buffer disable
.equ	DAC_CR_TEN2,	0x00040000	@ DAC channel2 Trigger enable

.equ	DAC_CR_TSEL2,	0x00380000	@ TSEL2[2:0] (DAC channel2 Trigger selection)
.equ	DAC_CR_TSEL2_0,	0x00080000	@ Bit 0
.equ	DAC_CR_TSEL2_1,	0x00100000	@ Bit 1
.equ	DAC_CR_TSEL2_2,	0x00200000	@ Bit 2

.equ	DAC_CR_WAVE2,	0x00C00000	@ WAVE2[1:0] (DAC channel2 noise/triangle wave generation enable)
.equ	DAC_CR_WAVE2_0,	0x00400000	@ Bit 0
.equ	DAC_CR_WAVE2_1,	0x00800000	@ Bit 1

.equ	DAC_CR_MAMP2,	0x0F000000	@ MAMP2[3:0] (DAC channel2 Mask/Amplitude selector)
.equ	DAC_CR_MAMP2_0,	0x01000000	@ Bit 0
.equ	DAC_CR_MAMP2_1,	0x02000000	@ Bit 1
.equ	DAC_CR_MAMP2_2,	0x04000000	@ Bit 2
.equ	DAC_CR_MAMP2_3,	0x08000000	@ Bit 3

.equ	DAC_CR_DMAEN2,	0x10000000	@ DAC channel2 DMA enabled

@ Bit definition for DAC_SWTRIGR register
.equ	DAC_SWTRIGR_SWTRIG1,	0x01	@ DAC channel1 software trigger
.equ	DAC_SWTRIGR_SWTRIG2,	0x02	@ DAC channel2 software trigger

@ Bit definition for DAC_DHR12R1 register
.equ	DAC_DHR12R1_DACC1DHR,	0x0FFF	@ DAC channel1 12-bit Right aligned data

@ Bit definition for DAC_DHR12L1 register
.equ	DAC_DHR12L1_DACC1DHR,	0xFFF0	@ DAC channel1 12-bit Left aligned data

@ Bit definition for DAC_DHR8R1 register
.equ	DAC_DHR8R1_DACC1DHR,	0xFF	@ DAC channel1 8-bit Right aligned data

@ Bit definition for DAC_DHR12R2 register
.equ	DAC_DHR12R2_DACC2DHR,	0x0FFF	@ DAC channel2 12-bit Right aligned data

@ Bit definition for DAC_DHR12L2 register
.equ	DAC_DHR12L2_DACC2DHR,	0xFFF0	@ DAC channel2 12-bit Left aligned data

@ Bit definition for DAC_DHR8R2 register
.equ	DAC_DHR8R2_DACC2DHR,	0xFF	@ DAC channel2 8-bit Right aligned data

@ Bit definition for DAC_DHR12RD register
.equ	DAC_DHR12RD_DACC1DHR,	0x00000FFF	@ DAC channel1 12-bit Right aligned data
.equ	DAC_DHR12RD_DACC2DHR,	0x0FFF0000	@ DAC channel2 12-bit Right aligned data

@ Bit definition for DAC_DHR12LD register
.equ	DAC_DHR12LD_DACC1DHR,	0x0000FFF0	@ DAC channel1 12-bit Left aligned data
.equ	DAC_DHR12LD_DACC2DHR,	0xFFF00000	@ DAC channel2 12-bit Left aligned data

@ Bit definition for DAC_DHR8RD register
.equ	DAC_DHR8RD_DACC1DHR,	0x00FF	@ DAC channel1 8-bit Right aligned data
.equ	DAC_DHR8RD_DACC2DHR,	0xFF00	@ DAC channel2 8-bit Right aligned data

@ Bit definition for DAC_DOR1 register
.equ	DAC_DOR1_DACC1DOR,	0x0FFF	@ DAC channel1 data output

@ Bit definition for DAC_DOR2 register
.equ	DAC_DOR2_DACC2DOR,	0x0FFF	@ DAC channel2 data output


@
@ TIM
@


@ Bit definition for TIM_CR1 register
.equ	TIM_CR1_CEN,	0x0001	@ Counter enable
.equ	TIM_CR1_UDIS,	0x0002	@ Update disable
.equ	TIM_CR1_URS,	0x0004	@ Update request source
.equ	TIM_CR1_OPM,	0x0008	@ One pulse mode
.equ	TIM_CR1_DIR,	0x0010	@ Direction

.equ	TIM_CR1_CMS,	0x0060	@ CMS[1:0] bits (Center-aligned mode selection)
.equ	TIM_CR1_CMS_0,	0x0020	@ Bit 0
.equ	TIM_CR1_CMS_1,	0x0040	@ Bit 1

.equ	TIM_CR1_ARPE,	0x0080	@ Auto-reload preload enable

.equ	TIM_CR1_CKD,	0x0300	@ CKD[1:0] bits (clock division)
.equ	TIM_CR1_CKD_0,	0x0100	@ Bit 0
.equ	TIM_CR1_CKD_1,	0x0200	@ Bit 1

@ Bit definition for TIM_CR2 register
.equ	TIM_CR2_CCPC,	0x0001	@ Capture/Compare Preloaded Control
.equ	TIM_CR2_CCUS,	0x0004	@ Capture/Compare Control Update Selection
.equ	TIM_CR2_CCDS,	0x0008	@ Capture/Compare DMA Selection

.equ	TIM_CR2_MMS,	0x0070	@ MMS[2:0] bits (Master Mode Selection)
.equ	TIM_CR2_MMS_0,	0x0010	@ Bit 0
.equ	TIM_CR2_MMS_1,	0x0020	@ Bit 1
.equ	TIM_CR2_MMS_2,	0x0040	@ Bit 2

