seradya/Lab1_Asm/Lab1_HelloWorld/Core/Asm/stm32l1xx.s
.equ	TIM_CR2_TI1S,	0x0080	@ TI1 Selection
.equ	TIM_CR2_OIS1,	0x0100	@ Output Idle state 1 (OC1 output)
.equ	TIM_CR2_OIS1N,	0x0200	@ Output Idle state 1 (OC1N output)
.equ	TIM_CR2_OIS2,	0x0400	@ Output Idle state 2 (OC2 output)
.equ	TIM_CR2_OIS2N,	0x0800	@ Output Idle state 2 (OC2N output)
.equ	TIM_CR2_OIS3,	0x1000	@ Output Idle state 3 (OC3 output)
.equ	TIM_CR2_OIS3N,	0x2000	@ Output Idle state 3 (OC3N output)
.equ	TIM_CR2_OIS4,	0x4000	@ Output Idle state 4 (OC4 output)

@ Bit definition for TIM_SMCR register
.equ	TIM_SMCR_SMS,	0x0007	@ SMS[2:0] bits (Slave mode selection)
.equ	TIM_SMCR_SMS_0,	0x0001	@ Bit 0
.equ	TIM_SMCR_SMS_1,	0x0002	@ Bit 1
.equ	TIM_SMCR_SMS_2,	0x0004	@ Bit 2

.equ	TIM_SMCR_TS,	0x0070	@ TS[2:0] bits (Trigger selection)
.equ	TIM_SMCR_TS_0,	0x0010	@ Bit 0
.equ	TIM_SMCR_TS_1,	0x0020	@ Bit 1
.equ	TIM_SMCR_TS_2,	0x0040	@ Bit 2

.equ	TIM_SMCR_MSM,	0x0080	@ Master/slave mode

.equ	TIM_SMCR_ETF,	0x0F00	@ ETF[3:0] bits (External trigger filter)
.equ	TIM_SMCR_ETF_0,	0x0100	@ Bit 0
.equ	TIM_SMCR_ETF_1,	0x0200	@ Bit 1
.equ	TIM_SMCR_ETF_2,	0x0400	@ Bit 2
.equ	TIM_SMCR_ETF_3,	0x0800	@ Bit 3

.equ	TIM_SMCR_ETPS,	0x3000	@ ETPS[1:0] bits (External trigger prescaler)
.equ	TIM_SMCR_ETPS_0,	0x1000	@ Bit 0
.equ	TIM_SMCR_ETPS_1,	0x2000	@ Bit 1

.equ	TIM_SMCR_ECE,	0x4000	@ External clock enable
.equ	TIM_SMCR_ETP,	0x8000	@ External trigger polarity

@ Bit definition for TIM_DIER register
.equ	TIM_DIER_UIE,	0x0001	@ Update interrupt enable
.equ	TIM_DIER_CC1IE,	0x0002	@ Capture/Compare 1 interrupt enable
.equ	TIM_DIER_CC2IE,	0x0004	@ Capture/Compare 2 interrupt enable
.equ	TIM_DIER_CC3IE,	0x0008	@ Capture/Compare 3 interrupt enable
.equ	TIM_DIER_CC4IE,	0x0010	@ Capture/Compare 4 interrupt enable
.equ	TIM_DIER_COMIE,	0x0020	@ COM interrupt enable
.equ	TIM_DIER_TIE,	0x0040	@ Trigger interrupt enable
.equ	TIM_DIER_BIE,	0x0080	@ Break interrupt enable
.equ	TIM_DIER_UDE,	0x0100	@ Update DMA request enable
.equ	TIM_DIER_CC1DE,	0x0200	@ Capture/Compare 1 DMA request enable
.equ	TIM_DIER_CC2DE,	0x0400	@ Capture/Compare 2 DMA request enable
.equ	TIM_DIER_CC3DE,	0x0800	@ Capture/Compare 3 DMA request enable
.equ	TIM_DIER_CC4DE,	0x1000	@ Capture/Compare 4 DMA request enable
.equ	TIM_DIER_COMDE,	0x2000	@ COM DMA request enable
.equ	TIM_DIER_TDE,	0x4000	@ Trigger DMA request enable

@ Bit definition for TIM_SR register
.equ	TIM_SR_UIF,	0x0001	@ Update interrupt Flag
.equ	TIM_SR_CC1IF,	0x0002	@ Capture/Compare 1 interrupt Flag
.equ	TIM_SR_CC2IF,	0x0004	@ Capture/Compare 2 interrupt Flag
.equ	TIM_SR_CC3IF,	0x0008	@ Capture/Compare 3 interrupt Flag
.equ	TIM_SR_CC4IF,	0x0010	@ Capture/Compare 4 interrupt Flag
.equ	TIM_SR_COMIF,	0x0020	@ COM interrupt Flag
.equ	TIM_SR_TIF,	0x0040	@ Trigger interrupt Flag
.equ	TIM_SR_BIF,	0x0080	@ Break interrupt Flag
.equ	TIM_SR_CC1OF,	0x0200	@ Capture/Compare 1 Overcapture Flag
.equ	TIM_SR_CC2OF,	0x0400	@ Capture/Compare 2 Overcapture Flag
.equ	TIM_SR_CC3OF,	0x0800	@ Capture/Compare 3 Overcapture Flag
.equ	TIM_SR_CC4OF,	0x1000	@ Capture/Compare 4 Overcapture Flag

@ Bit definition for TIM_EGR register
.equ	TIM_EGR_UG,	0x01	@ Update Generation
.equ	TIM_EGR_CC1G,	0x02	@ Capture/Compare 1 Generation
.equ	TIM_EGR_CC2G,	0x04	@ Capture/Compare 2 Generation
.equ	TIM_EGR_CC3G,	0x08	@ Capture/Compare 3 Generation
.equ	TIM_EGR_CC4G,	0x10	@ Capture/Compare 4 Generation
.equ	TIM_EGR_COMG,	0x20	@ Capture/Compare Control Update Generation
.equ	TIM_EGR_TG,	0x40	@ Trigger Generation
.equ	TIM_EGR_BG,	0x80	@ Break Generation

@ Bit definition for TIM_CCMR1 register
.equ	TIM_CCMR1_CC1S,	0x0003	@ CC1S[1:0] bits (Capture/Compare 1 Selection)
.equ	TIM_CCMR1_CC1S_0,	0x0001	@ Bit 0
.equ	TIM_CCMR1_CC1S_1,	0x0002	@ Bit 1

.equ	TIM_CCMR1_OC1FE,	0x0004	@ Output Compare 1 Fast enable
.equ	TIM_CCMR1_OC1PE,	0x0008	@ Output Compare 1 Preload enable

.equ	TIM_CCMR1_OC1M,	0x0070	@ OC1M[2:0] bits (Output Compare 1 Mode)
.equ	TIM_CCMR1_OC1M_0,	0x0010	@ Bit 0
.equ	TIM_CCMR1_OC1M_1,	0x0020	@ Bit 1
.equ	TIM_CCMR1_OC1M_2,	0x0040	@ Bit 2

.equ	TIM_CCMR1_OC1CE,	0x0080	@ Output Compare 1Clear Enable

.equ	TIM_CCMR1_CC2S,	0x0300	@ CC2S[1:0] bits (Capture/Compare 2 Selection)
.equ	TIM_CCMR1_CC2S_0,	0x0100	@ Bit 0
.equ	TIM_CCMR1_CC2S_1,	0x0200	@ Bit 1

.equ	TIM_CCMR1_OC2FE,	0x0400	@ Output Compare 2 Fast enable
.equ	TIM_CCMR1_OC2PE,	0x0800	@ Output Compare 2 Preload enable

.equ	TIM_CCMR1_OC2M,	0x7000	@ OC2M[2:0] bits (Output Compare 2 Mode)
.equ	TIM_CCMR1_OC2M_0,	0x1000	@ Bit 0
.equ	TIM_CCMR1_OC2M_1,	0x2000	@ Bit 1
.equ	TIM_CCMR1_OC2M_2,	0x4000	@ Bit 2

.equ	TIM_CCMR1_OC2CE,	0x8000	@ Output Compare 2 Clear Enable

@----------------------------------------------------------------------------

.equ	TIM_CCMR1_IC1PSC,	0x000C	@ IC1PSC[1:0] bits (Input Capture 1 Prescaler)
.equ	TIM_CCMR1_IC1PSC_0,	0x0004	@ Bit 0
.equ	TIM_CCMR1_IC1PSC_1,	0x0008	@ Bit 1

.equ	TIM_CCMR1_IC1F,	0x00F0	@ IC1F[3:0] bits (Input Capture 1 Filter)
.equ	TIM_CCMR1_IC1F_0,	0x0010	@ Bit 0
.equ	TIM_CCMR1_IC1F_1,	0x0020	@ Bit 1
.equ	TIM_CCMR1_IC1F_2,	0x0040	@ Bit 2
.equ	TIM_CCMR1_IC1F_3,	0x0080	@ Bit 3

.equ	TIM_CCMR1_IC2PSC,	0x0C00	@ IC2PSC[1:0] bits (Input Capture 2 Prescaler)
.equ	TIM_CCMR1_IC2PSC_0,	0x0400	@ Bit 0
.equ	TIM_CCMR1_IC2PSC_1,	0x0800	@ Bit 1

.equ	TIM_CCMR1_IC2F,	0xF000	@ IC2F[3:0] bits (Input Capture 2 Filter)
.equ	TIM_CCMR1_IC2F_0,	0x1000	@ Bit 0
.equ	TIM_CCMR1_IC2F_1,	0x2000	@ Bit 1
.equ	TIM_CCMR1_IC2F_2,	0x4000	@ Bit 2
.equ	TIM_CCMR1_IC2F_3,	0x8000	@ Bit 3

@ Bit definition for TIM_CCMR2 register
.equ	TIM_CCMR2_CC3S,	0x0003	@ CC3S[1:0] bits (Capture/Compare 3 Selection)
.equ	TIM_CCMR2_CC3S_0,	0x0001	@ Bit 0
.equ	TIM_CCMR2_CC3S_1,	0x0002	@ Bit 1

.equ	TIM_CCMR2_OC3FE,	0x0004	@ Output Compare 3 Fast enable
.equ	TIM_CCMR2_OC3PE,	0x0008	@ Output Compare 3 Preload enable

.equ	TIM_CCMR2_OC3M,	0x0070	@ OC3M[2:0] bits (Output Compare 3 Mode)
.equ	TIM_CCMR2_OC3M_0,	0x0010	@ Bit 0
.equ	TIM_CCMR2_OC3M_1,	0x0020	@ Bit 1
.equ	TIM_CCMR2_OC3M_2,	0x0040	@ Bit 2

.equ	TIM_CCMR2_OC3CE,	0x0080	@ Output Compare 3 Clear Enable

.equ	TIM_CCMR2_CC4S,	0x0300	@ CC4S[1:0] bits (Capture/Compare 4 Selection)
.equ	TIM_CCMR2_CC4S_0,	0x0100	@ Bit 0
.equ	TIM_CCMR2_CC4S_1,	0x0200	@ Bit 1

.equ	TIM_CCMR2_OC4FE,	0x0400	@ Output Compare 4 Fast enable
.equ	TIM_CCMR2_OC4PE,	0x0800	@ Output Compare 4 Preload enable

