seradya/Lab1_Asm/Lab1_HelloWorld/Core/Asm/stm32l1xx.s
@ Bit definition for USB_COUNT6_TX_0 register
.equ	USB_COUNT6_TX_0_COUNT6_TX_0,	0x000003FF	@ Transmission Byte Count 6 (low)

@ Bit definition for USB_COUNT6_TX_1 register
.equ	USB_COUNT6_TX_1_COUNT6_TX_1,	0x03FF0000	@ Transmission Byte Count 6 (high)

@ Bit definition for USB_COUNT7_TX_0 register
.equ	USB_COUNT7_TX_0_COUNT7_TX_0,	0x000003FF	@ Transmission Byte Count 7 (low)

@ Bit definition for USB_COUNT7_TX_1 register
.equ	USB_COUNT7_TX_1_COUNT7_TX_1,	0x03FF0000	@ Transmission Byte Count 7 (high)

@----------------------------------------------------------------------------

@ Bit definition for USB_ADDR0_RX register
.equ	USB_ADDR0_RX_ADDR0_RX,	0xFFFE	@ Reception Buffer Address 0

@ Bit definition for USB_ADDR1_RX register
.equ	USB_ADDR1_RX_ADDR1_RX,	0xFFFE	@ Reception Buffer Address 1

@ Bit definition for USB_ADDR2_RX register
.equ	USB_ADDR2_RX_ADDR2_RX,	0xFFFE	@ Reception Buffer Address 2

@ Bit definition for USB_ADDR3_RX register
.equ	USB_ADDR3_RX_ADDR3_RX,	0xFFFE	@ Reception Buffer Address 3

@ Bit definition for USB_ADDR4_RX register
.equ	USB_ADDR4_RX_ADDR4_RX,	0xFFFE	@ Reception Buffer Address 4

@ Bit definition for USB_ADDR5_RX register
.equ	USB_ADDR5_RX_ADDR5_RX,	0xFFFE	@ Reception Buffer Address 5

@ Bit definition for USB_ADDR6_RX register
.equ	USB_ADDR6_RX_ADDR6_RX,	0xFFFE	@ Reception Buffer Address 6

@ Bit definition for USB_ADDR7_RX register
.equ	USB_ADDR7_RX_ADDR7_RX,	0xFFFE	@ Reception Buffer Address 7

@----------------------------------------------------------------------------

@ Bit definition for USB_COUNT0_RX register
.equ	USB_COUNT0_RX_COUNT0_RX,	0x03FF	@ Reception Byte Count

.equ	USB_COUNT0_RX_NUM_BLOCK,	0x7C00	@ NUM_BLOCK[4:0] bits (Number of blocks)
.equ	USB_COUNT0_RX_NUM_BLOCK_0,	0x0400	@ Bit 0
.equ	USB_COUNT0_RX_NUM_BLOCK_1,	0x0800	@ Bit 1
.equ	USB_COUNT0_RX_NUM_BLOCK_2,	0x1000	@ Bit 2
.equ	USB_COUNT0_RX_NUM_BLOCK_3,	0x2000	@ Bit 3
.equ	USB_COUNT0_RX_NUM_BLOCK_4,	0x4000	@ Bit 4

.equ	USB_COUNT0_RX_BLSIZE,	0x8000	@ BLock SIZE

@ Bit definition for USB_COUNT1_RX register
.equ	USB_COUNT1_RX_COUNT1_RX,	0x03FF	@ Reception Byte Count

.equ	USB_COUNT1_RX_NUM_BLOCK,	0x7C00	@ NUM_BLOCK[4:0] bits (Number of blocks)
.equ	USB_COUNT1_RX_NUM_BLOCK_0,	0x0400	@ Bit 0
.equ	USB_COUNT1_RX_NUM_BLOCK_1,	0x0800	@ Bit 1
.equ	USB_COUNT1_RX_NUM_BLOCK_2,	0x1000	@ Bit 2
.equ	USB_COUNT1_RX_NUM_BLOCK_3,	0x2000	@ Bit 3
.equ	USB_COUNT1_RX_NUM_BLOCK_4,	0x4000	@ Bit 4

.equ	USB_COUNT1_RX_BLSIZE,	0x8000	@ BLock SIZE

@ Bit definition for USB_COUNT2_RX register
.equ	USB_COUNT2_RX_COUNT2_RX,	0x03FF	@ Reception Byte Count

.equ	USB_COUNT2_RX_NUM_BLOCK,	0x7C00	@ NUM_BLOCK[4:0] bits (Number of blocks)
.equ	USB_COUNT2_RX_NUM_BLOCK_0,	0x0400	@ Bit 0
.equ	USB_COUNT2_RX_NUM_BLOCK_1,	0x0800	@ Bit 1
.equ	USB_COUNT2_RX_NUM_BLOCK_2,	0x1000	@ Bit 2
.equ	USB_COUNT2_RX_NUM_BLOCK_3,	0x2000	@ Bit 3
.equ	USB_COUNT2_RX_NUM_BLOCK_4,	0x4000	@ Bit 4

.equ	USB_COUNT2_RX_BLSIZE,	0x8000	@ BLock SIZE

@ Bit definition for USB_COUNT3_RX register
.equ	USB_COUNT3_RX_COUNT3_RX,	0x03FF	@ Reception Byte Count

.equ	USB_COUNT3_RX_NUM_BLOCK,	0x7C00	@ NUM_BLOCK[4:0] bits (Number of blocks)
.equ	USB_COUNT3_RX_NUM_BLOCK_0,	0x0400	@ Bit 0
.equ	USB_COUNT3_RX_NUM_BLOCK_1,	0x0800	@ Bit 1
.equ	USB_COUNT3_RX_NUM_BLOCK_2,	0x1000	@ Bit 2
.equ	USB_COUNT3_RX_NUM_BLOCK_3,	0x2000	@ Bit 3
.equ	USB_COUNT3_RX_NUM_BLOCK_4,	0x4000	@ Bit 4

.equ	USB_COUNT3_RX_BLSIZE,	0x8000	@ BLock SIZE

@ Bit definition for USB_COUNT4_RX register
.equ	USB_COUNT4_RX_COUNT4_RX,	0x03FF	@ Reception Byte Count

.equ	USB_COUNT4_RX_NUM_BLOCK,	0x7C00	@ NUM_BLOCK[4:0] bits (Number of blocks)
.equ	USB_COUNT4_RX_NUM_BLOCK_0,	0x0400	@ Bit 0
.equ	USB_COUNT4_RX_NUM_BLOCK_1,	0x0800	@ Bit 1
.equ	USB_COUNT4_RX_NUM_BLOCK_2,	0x1000	@ Bit 2
.equ	USB_COUNT4_RX_NUM_BLOCK_3,	0x2000	@ Bit 3
.equ	USB_COUNT4_RX_NUM_BLOCK_4,	0x4000	@ Bit 4

.equ	USB_COUNT4_RX_BLSIZE,	0x8000	@ BLock SIZE

@ Bit definition for USB_COUNT5_RX register
.equ	USB_COUNT5_RX_COUNT5_RX,	0x03FF	@ Reception Byte Count

.equ	USB_COUNT5_RX_NUM_BLOCK,	0x7C00	@ NUM_BLOCK[4:0] bits (Number of blocks)
.equ	USB_COUNT5_RX_NUM_BLOCK_0,	0x0400	@ Bit 0
.equ	USB_COUNT5_RX_NUM_BLOCK_1,	0x0800	@ Bit 1
.equ	USB_COUNT5_RX_NUM_BLOCK_2,	0x1000	@ Bit 2
.equ	USB_COUNT5_RX_NUM_BLOCK_3,	0x2000	@ Bit 3
.equ	USB_COUNT5_RX_NUM_BLOCK_4,	0x4000	@ Bit 4

.equ	USB_COUNT5_RX_BLSIZE,	0x8000	@ BLock SIZE

@ Bit definition for USB_COUNT6_RX register
.equ	USB_COUNT6_RX_COUNT6_RX,	0x03FF	@ Reception Byte Count

.equ	USB_COUNT6_RX_NUM_BLOCK,	0x7C00	@ NUM_BLOCK[4:0] bits (Number of blocks)
.equ	USB_COUNT6_RX_NUM_BLOCK_0,	0x0400	@ Bit 0
.equ	USB_COUNT6_RX_NUM_BLOCK_1,	0x0800	@ Bit 1
.equ	USB_COUNT6_RX_NUM_BLOCK_2,	0x1000	@ Bit 2
.equ	USB_COUNT6_RX_NUM_BLOCK_3,	0x2000	@ Bit 3
.equ	USB_COUNT6_RX_NUM_BLOCK_4,	0x4000	@ Bit 4

.equ	USB_COUNT6_RX_BLSIZE,	0x8000	@ BLock SIZE

@ Bit definition for USB_COUNT7_RX register
.equ	USB_COUNT7_RX_COUNT7_RX,	0x03FF	@ Reception Byte Count

.equ	USB_COUNT7_RX_NUM_BLOCK,	0x7C00	@ NUM_BLOCK[4:0] bits (Number of blocks)
.equ	USB_COUNT7_RX_NUM_BLOCK_0,	0x0400	@ Bit 0
.equ	USB_COUNT7_RX_NUM_BLOCK_1,	0x0800	@ Bit 1
.equ	USB_COUNT7_RX_NUM_BLOCK_2,	0x1000	@ Bit 2
.equ	USB_COUNT7_RX_NUM_BLOCK_3,	0x2000	@ Bit 3
.equ	USB_COUNT7_RX_NUM_BLOCK_4,	0x4000	@ Bit 4

.equ	USB_COUNT7_RX_BLSIZE,	0x8000	@ BLock SIZE

@----------------------------------------------------------------------------

@ Bit definition for USB_COUNT0_RX_0 register
.equ	USB_COUNT0_RX_0_COUNT0_RX_0,	0x000003FF	@ Reception Byte Count (low)

.equ	USB_COUNT0_RX_0_NUM_BLOCK_0,	0x00007C00	@ NUM_BLOCK_0[4:0] bits (Number of blocks) (low)
.equ	USB_COUNT0_RX_0_NUM_BLOCK_0_0,	0x00000400	@ Bit 0
.equ	USB_COUNT0_RX_0_NUM_BLOCK_0_1,	0x00000800	@ Bit 1
.equ	USB_COUNT0_RX_0_NUM_BLOCK_0_2,	0x00001000	@ Bit 2
.equ	USB_COUNT0_RX_0_NUM_BLOCK_0_3,	0x00002000	@ Bit 3
.equ	USB_COUNT0_RX_0_NUM_BLOCK_0_4,	0x00004000	@ Bit 4

.equ	USB_COUNT0_RX_0_BLSIZE_0,	0x00008000	@ BLock SIZE (low)

@ Bit definition for USB_COUNT0_RX_1 register
.equ	USB_COUNT0_RX_1_COUNT0_RX_1,	0x03FF0000	@ Reception Byte Count (high)

.equ	USB_COUNT0_RX_1_NUM_BLOCK_1,	0x7C000000	@ NUM_BLOCK_1[4:0] bits (Number of blocks) (high)
.equ	USB_COUNT0_RX_1_NUM_BLOCK_1_0,	0x04000000	@ Bit 1
.equ	USB_COUNT0_RX_1_NUM_BLOCK_1_1,	0x08000000	@ Bit 1
.equ	USB_COUNT0_RX_1_NUM_BLOCK_1_2,	0x10000000	@ Bit 2
.equ	USB_COUNT0_RX_1_NUM_BLOCK_1_3,	0x20000000	@ Bit 3
.equ	USB_COUNT0_RX_1_NUM_BLOCK_1_4,	0x40000000	@ Bit 4

.equ	USB_COUNT0_RX_1_BLSIZE_1,	0x80000000	@ BLock SIZE (high)

@ Bit definition for USB_COUNT1_RX_0 register
.equ	USB_COUNT1_RX_0_COUNT1_RX_0,	0x000003FF	@ Reception Byte Count (low)

.equ	USB_COUNT1_RX_0_NUM_BLOCK_0,	0x00007C00	@ NUM_BLOCK_0[4:0] bits (Number of blocks) (low)
.equ	USB_COUNT1_RX_0_NUM_BLOCK_0_0,	0x00000400	@ Bit 0
.equ	USB_COUNT1_RX_0_NUM_BLOCK_0_1,	0x00000800	@ Bit 1
.equ	USB_COUNT1_RX_0_NUM_BLOCK_0_2,	0x00001000	@ Bit 2
.equ	USB_COUNT1_RX_0_NUM_BLOCK_0_3,	0x00002000	@ Bit 3
.equ	USB_COUNT1_RX_0_NUM_BLOCK_0_4,	0x00004000	@ Bit 4

