seradya/Lab1_Asm/Lab1_HelloWorld/Core/Asm/stm32l1xx.s
.equ	USB_COUNT1_RX_0_BLSIZE_0,	0x00008000	@ BLock SIZE (low)

@ Bit definition for USB_COUNT1_RX_1 register
.equ	USB_COUNT1_RX_1_COUNT1_RX_1,	0x03FF0000	@ Reception Byte Count (high)

.equ	USB_COUNT1_RX_1_NUM_BLOCK_1,	0x7C000000	@ NUM_BLOCK_1[4:0] bits (Number of blocks) (high)
.equ	USB_COUNT1_RX_1_NUM_BLOCK_1_0,	0x04000000	@ Bit 0
.equ	USB_COUNT1_RX_1_NUM_BLOCK_1_1,	0x08000000	@ Bit 1
.equ	USB_COUNT1_RX_1_NUM_BLOCK_1_2,	0x10000000	@ Bit 2
.equ	USB_COUNT1_RX_1_NUM_BLOCK_1_3,	0x20000000	@ Bit 3
.equ	USB_COUNT1_RX_1_NUM_BLOCK_1_4,	0x40000000	@ Bit 4

.equ	USB_COUNT1_RX_1_BLSIZE_1,	0x80000000	@ BLock SIZE (high)

@ Bit definition for USB_COUNT2_RX_0 register
.equ	USB_COUNT2_RX_0_COUNT2_RX_0,	0x000003FF	@ Reception Byte Count (low)

.equ	USB_COUNT2_RX_0_NUM_BLOCK_0,	0x00007C00	@ NUM_BLOCK_0[4:0] bits (Number of blocks) (low)
.equ	USB_COUNT2_RX_0_NUM_BLOCK_0_0,	0x00000400	@ Bit 0
.equ	USB_COUNT2_RX_0_NUM_BLOCK_0_1,	0x00000800	@ Bit 1
.equ	USB_COUNT2_RX_0_NUM_BLOCK_0_2,	0x00001000	@ Bit 2
.equ	USB_COUNT2_RX_0_NUM_BLOCK_0_3,	0x00002000	@ Bit 3
.equ	USB_COUNT2_RX_0_NUM_BLOCK_0_4,	0x00004000	@ Bit 4

.equ	USB_COUNT2_RX_0_BLSIZE_0,	0x00008000	@ BLock SIZE (low)

@ Bit definition for USB_COUNT2_RX_1 register
.equ	USB_COUNT2_RX_1_COUNT2_RX_1,	0x03FF0000	@ Reception Byte Count (high)

.equ	USB_COUNT2_RX_1_NUM_BLOCK_1,	0x7C000000	@ NUM_BLOCK_1[4:0] bits (Number of blocks) (high)
.equ	USB_COUNT2_RX_1_NUM_BLOCK_1_0,	0x04000000	@ Bit 0
.equ	USB_COUNT2_RX_1_NUM_BLOCK_1_1,	0x08000000	@ Bit 1
.equ	USB_COUNT2_RX_1_NUM_BLOCK_1_2,	0x10000000	@ Bit 2
.equ	USB_COUNT2_RX_1_NUM_BLOCK_1_3,	0x20000000	@ Bit 3
.equ	USB_COUNT2_RX_1_NUM_BLOCK_1_4,	0x40000000	@ Bit 4

.equ	USB_COUNT2_RX_1_BLSIZE_1,	0x80000000	@ BLock SIZE (high)

@ Bit definition for USB_COUNT3_RX_0 register
.equ	USB_COUNT3_RX_0_COUNT3_RX_0,	0x000003FF	@ Reception Byte Count (low)

.equ	USB_COUNT3_RX_0_NUM_BLOCK_0,	0x00007C00	@ NUM_BLOCK_0[4:0] bits (Number of blocks) (low)
.equ	USB_COUNT3_RX_0_NUM_BLOCK_0_0,	0x00000400	@ Bit 0
.equ	USB_COUNT3_RX_0_NUM_BLOCK_0_1,	0x00000800	@ Bit 1
.equ	USB_COUNT3_RX_0_NUM_BLOCK_0_2,	0x00001000	@ Bit 2
.equ	USB_COUNT3_RX_0_NUM_BLOCK_0_3,	0x00002000	@ Bit 3
.equ	USB_COUNT3_RX_0_NUM_BLOCK_0_4,	0x00004000	@ Bit 4

.equ	USB_COUNT3_RX_0_BLSIZE_0,	0x00008000	@ BLock SIZE (low)

@ Bit definition for USB_COUNT3_RX_1 register
.equ	USB_COUNT3_RX_1_COUNT3_RX_1,	0x03FF0000	@ Reception Byte Count (high)

.equ	USB_COUNT3_RX_1_NUM_BLOCK_1,	0x7C000000	@ NUM_BLOCK_1[4:0] bits (Number of blocks) (high)
.equ	USB_COUNT3_RX_1_NUM_BLOCK_1_0,	0x04000000	@ Bit 0
.equ	USB_COUNT3_RX_1_NUM_BLOCK_1_1,	0x08000000	@ Bit 1
.equ	USB_COUNT3_RX_1_NUM_BLOCK_1_2,	0x10000000	@ Bit 2
.equ	USB_COUNT3_RX_1_NUM_BLOCK_1_3,	0x20000000	@ Bit 3
.equ	USB_COUNT3_RX_1_NUM_BLOCK_1_4,	0x40000000	@ Bit 4

.equ	USB_COUNT3_RX_1_BLSIZE_1,	0x80000000	@ BLock SIZE (high)

@ Bit definition for USB_COUNT4_RX_0 register
.equ	USB_COUNT4_RX_0_COUNT4_RX_0,	0x000003FF	@ Reception Byte Count (low)

.equ	USB_COUNT4_RX_0_NUM_BLOCK_0,	0x00007C00	@ NUM_BLOCK_0[4:0] bits (Number of blocks) (low)
.equ	USB_COUNT4_RX_0_NUM_BLOCK_0_0,	0x00000400	@ Bit 0
.equ	USB_COUNT4_RX_0_NUM_BLOCK_0_1,	0x00000800	@ Bit 1
.equ	USB_COUNT4_RX_0_NUM_BLOCK_0_2,	0x00001000	@ Bit 2
.equ	USB_COUNT4_RX_0_NUM_BLOCK_0_3,	0x00002000	@ Bit 3
.equ	USB_COUNT4_RX_0_NUM_BLOCK_0_4,	0x00004000	@ Bit 4

.equ	USB_COUNT4_RX_0_BLSIZE_0,	0x00008000	@ BLock SIZE (low)

@ Bit definition for USB_COUNT4_RX_1 register
.equ	USB_COUNT4_RX_1_COUNT4_RX_1,	0x03FF0000	@ Reception Byte Count (high)

.equ	USB_COUNT4_RX_1_NUM_BLOCK_1,	0x7C000000	@ NUM_BLOCK_1[4:0] bits (Number of blocks) (high)
.equ	USB_COUNT4_RX_1_NUM_BLOCK_1_0,	0x04000000	@ Bit 0
.equ	USB_COUNT4_RX_1_NUM_BLOCK_1_1,	0x08000000	@ Bit 1
.equ	USB_COUNT4_RX_1_NUM_BLOCK_1_2,	0x10000000	@ Bit 2
.equ	USB_COUNT4_RX_1_NUM_BLOCK_1_3,	0x20000000	@ Bit 3
.equ	USB_COUNT4_RX_1_NUM_BLOCK_1_4,	0x40000000	@ Bit 4

.equ	USB_COUNT4_RX_1_BLSIZE_1,	0x80000000	@ BLock SIZE (high)

@ Bit definition for USB_COUNT5_RX_0 register
.equ	USB_COUNT5_RX_0_COUNT5_RX_0,	0x000003FF	@ Reception Byte Count (low)

.equ	USB_COUNT5_RX_0_NUM_BLOCK_0,	0x00007C00	@ NUM_BLOCK_0[4:0] bits (Number of blocks) (low)
.equ	USB_COUNT5_RX_0_NUM_BLOCK_0_0,	0x00000400	@ Bit 0
.equ	USB_COUNT5_RX_0_NUM_BLOCK_0_1,	0x00000800	@ Bit 1
.equ	USB_COUNT5_RX_0_NUM_BLOCK_0_2,	0x00001000	@ Bit 2
.equ	USB_COUNT5_RX_0_NUM_BLOCK_0_3,	0x00002000	@ Bit 3
.equ	USB_COUNT5_RX_0_NUM_BLOCK_0_4,	0x00004000	@ Bit 4

.equ	USB_COUNT5_RX_0_BLSIZE_0,	0x00008000	@ BLock SIZE (low)

@ Bit definition for USB_COUNT5_RX_1 register
.equ	USB_COUNT5_RX_1_COUNT5_RX_1,	0x03FF0000	@ Reception Byte Count (high)

.equ	USB_COUNT5_RX_1_NUM_BLOCK_1,	0x7C000000	@ NUM_BLOCK_1[4:0] bits (Number of blocks) (high)
.equ	USB_COUNT5_RX_1_NUM_BLOCK_1_0,	0x04000000	@ Bit 0
.equ	USB_COUNT5_RX_1_NUM_BLOCK_1_1,	0x08000000	@ Bit 1
.equ	USB_COUNT5_RX_1_NUM_BLOCK_1_2,	0x10000000	@ Bit 2
.equ	USB_COUNT5_RX_1_NUM_BLOCK_1_3,	0x20000000	@ Bit 3
.equ	USB_COUNT5_RX_1_NUM_BLOCK_1_4,	0x40000000	@ Bit 4

.equ	USB_COUNT5_RX_1_BLSIZE_1,	0x80000000	@ BLock SIZE (high)

@ Bit definition for USB_COUNT6_RX_0 register
.equ	USB_COUNT6_RX_0_COUNT6_RX_0,	0x000003FF	@ Reception Byte Count (low)

.equ	USB_COUNT6_RX_0_NUM_BLOCK_0,	0x00007C00	@ NUM_BLOCK_0[4:0] bits (Number of blocks) (low)
.equ	USB_COUNT6_RX_0_NUM_BLOCK_0_0,	0x00000400	@ Bit 0
.equ	USB_COUNT6_RX_0_NUM_BLOCK_0_1,	0x00000800	@ Bit 1
.equ	USB_COUNT6_RX_0_NUM_BLOCK_0_2,	0x00001000	@ Bit 2
.equ	USB_COUNT6_RX_0_NUM_BLOCK_0_3,	0x00002000	@ Bit 3
.equ	USB_COUNT6_RX_0_NUM_BLOCK_0_4,	0x00004000	@ Bit 4

.equ	USB_COUNT6_RX_0_BLSIZE_0,	0x00008000	@ BLock SIZE (low)

@ Bit definition for USB_COUNT6_RX_1 register
.equ	USB_COUNT6_RX_1_COUNT6_RX_1,	0x03FF0000	@ Reception Byte Count (high)

.equ	USB_COUNT6_RX_1_NUM_BLOCK_1,	0x7C000000	@ NUM_BLOCK_1[4:0] bits (Number of blocks) (high)
.equ	USB_COUNT6_RX_1_NUM_BLOCK_1_0,	0x04000000	@ Bit 0
.equ	USB_COUNT6_RX_1_NUM_BLOCK_1_1,	0x08000000	@ Bit 1
.equ	USB_COUNT6_RX_1_NUM_BLOCK_1_2,	0x10000000	@ Bit 2
.equ	USB_COUNT6_RX_1_NUM_BLOCK_1_3,	0x20000000	@ Bit 3
.equ	USB_COUNT6_RX_1_NUM_BLOCK_1_4,	0x40000000	@ Bit 4

