seradya/Lab1_Asm/Lab1_HelloWorld/Core/Asm/stm32l1xx.s
.equ	USB_COUNT6_RX_1_BLSIZE_1,	0x80000000	@ BLock SIZE (high)

@ Bit definition for USB_COUNT7_RX_0 register
.equ	USB_COUNT7_RX_0_COUNT7_RX_0,	0x000003FF	@ Reception Byte Count (low)

.equ	USB_COUNT7_RX_0_NUM_BLOCK_0,	0x00007C00	@ NUM_BLOCK_0[4:0] bits (Number of blocks) (low)
.equ	USB_COUNT7_RX_0_NUM_BLOCK_0_0,	0x00000400	@ Bit 0
.equ	USB_COUNT7_RX_0_NUM_BLOCK_0_1,	0x00000800	@ Bit 1
.equ	USB_COUNT7_RX_0_NUM_BLOCK_0_2,	0x00001000	@ Bit 2
.equ	USB_COUNT7_RX_0_NUM_BLOCK_0_3,	0x00002000	@ Bit 3
.equ	USB_COUNT7_RX_0_NUM_BLOCK_0_4,	0x00004000	@ Bit 4

.equ	USB_COUNT7_RX_0_BLSIZE_0,	0x00008000	@ BLock SIZE (low)

@ Bit definition for USB_COUNT7_RX_1 register
.equ	USB_COUNT7_RX_1_COUNT7_RX_1,	0x03FF0000	@ Reception Byte Count (high)

.equ	USB_COUNT7_RX_1_NUM_BLOCK_1,	0x7C000000	@ NUM_BLOCK_1[4:0] bits (Number of blocks) (high)
.equ	USB_COUNT7_RX_1_NUM_BLOCK_1_0,	0x04000000	@ Bit 0
.equ	USB_COUNT7_RX_1_NUM_BLOCK_1_1,	0x08000000	@ Bit 1
.equ	USB_COUNT7_RX_1_NUM_BLOCK_1_2,	0x10000000	@ Bit 2
.equ	USB_COUNT7_RX_1_NUM_BLOCK_1_3,	0x20000000	@ Bit 3
.equ	USB_COUNT7_RX_1_NUM_BLOCK_1_4,	0x40000000	@ Bit 4

.equ	USB_COUNT7_RX_1_BLSIZE_1,	0x80000000	@ BLock SIZE (high)


@
@ Controller Area Network
@


@ CAN control and status registers
@ Bit definition for CAN_MCR register
.equ	CAN_MCR_INRQ,	0x0001	@ Initialization Request
.equ	CAN_MCR_SLEEP,	0x0002	@ Sleep Mode Request
.equ	CAN_MCR_TXFP,	0x0004	@ Transmit FIFO Priority
.equ	CAN_MCR_RFLM,	0x0008	@ Receive FIFO Locked Mode
.equ	CAN_MCR_NART,	0x0010	@ No Automatic Retransmission
.equ	CAN_MCR_AWUM,	0x0020	@ Automatic Wakeup Mode
.equ	CAN_MCR_ABOM,	0x0040	@ Automatic Bus-Off Management
.equ	CAN_MCR_TTCM,	0x0080	@ Time Triggered Communication Mode
.equ	CAN_MCR_RESET,	0x8000	@ bxCAN software master reset

@ Bit definition for CAN_MSR register
.equ	CAN_MSR_INAK,	0x0001	@ Initialization Acknowledge
.equ	CAN_MSR_SLAK,	0x0002	@ Sleep Acknowledge
.equ	CAN_MSR_ERRI,	0x0004	@ Error Interrupt
.equ	CAN_MSR_WKUI,	0x0008	@ Wakeup Interrupt
.equ	CAN_MSR_SLAKI,	0x0010	@ Sleep Acknowledge Interrupt
.equ	CAN_MSR_TXM,	0x0100	@ Transmit Mode
.equ	CAN_MSR_RXM,	0x0200	@ Receive Mode
.equ	CAN_MSR_SAMP,	0x0400	@ Last Sample Point
.equ	CAN_MSR_RX,	0x0800	@ CAN Rx Signal

@ Bit definition for CAN_TSR register
.equ	CAN_TSR_RQCP0,	0x00000001	@ Request Completed Mailbox0
.equ	CAN_TSR_TXOK0,	0x00000002	@ Transmission OK of Mailbox0
.equ	CAN_TSR_ALST0,	0x00000004	@ Arbitration Lost for Mailbox0
.equ	CAN_TSR_TERR0,	0x00000008	@ Transmission Error of Mailbox0
.equ	CAN_TSR_ABRQ0,	0x00000080	@ Abort Request for Mailbox0
.equ	CAN_TSR_RQCP1,	0x00000100	@ Request Completed Mailbox1
.equ	CAN_TSR_TXOK1,	0x00000200	@ Transmission OK of Mailbox1
.equ	CAN_TSR_ALST1,	0x00000400	@ Arbitration Lost for Mailbox1
.equ	CAN_TSR_TERR1,	0x00000800	@ Transmission Error of Mailbox1
.equ	CAN_TSR_ABRQ1,	0x00008000	@ Abort Request for Mailbox 1
.equ	CAN_TSR_RQCP2,	0x00010000	@ Request Completed Mailbox2
.equ	CAN_TSR_TXOK2,	0x00020000	@ Transmission OK of Mailbox 2
.equ	CAN_TSR_ALST2,	0x00040000	@ Arbitration Lost for mailbox 2
.equ	CAN_TSR_TERR2,	0x00080000	@ Transmission Error of Mailbox 2
.equ	CAN_TSR_ABRQ2,	0x00800000	@ Abort Request for Mailbox 2
.equ	CAN_TSR_CODE,	0x03000000	@ Mailbox Code

.equ	CAN_TSR_TME,	0x1C000000	@ TME[2:0] bits
.equ	CAN_TSR_TME0,	0x04000000	@ Transmit Mailbox 0 Empty
.equ	CAN_TSR_TME1,	0x08000000	@ Transmit Mailbox 1 Empty
.equ	CAN_TSR_TME2,	0x10000000	@ Transmit Mailbox 2 Empty

.equ	CAN_TSR_LOW,	0xE0000000	@ LOW[2:0] bits
.equ	CAN_TSR_LOW0,	0x20000000	@ Lowest Priority Flag for Mailbox 0
.equ	CAN_TSR_LOW1,	0x40000000	@ Lowest Priority Flag for Mailbox 1
.equ	CAN_TSR_LOW2,	0x80000000	@ Lowest Priority Flag for Mailbox 2

@ Bit definition for CAN_RF0R register
.equ	CAN_RF0R_FMP0,	0x03	@ FIFO 0 Message Pending
.equ	CAN_RF0R_FULL0,	0x08	@ FIFO 0 Full
.equ	CAN_RF0R_FOVR0,	0x10	@ FIFO 0 Overrun
.equ	CAN_RF0R_RFOM0,	0x20	@ Release FIFO 0 Output Mailbox

@ Bit definition for CAN_RF1R register
.equ	CAN_RF1R_FMP1,	0x03	@ FIFO 1 Message Pending
.equ	CAN_RF1R_FULL1,	0x08	@ FIFO 1 Full
.equ	CAN_RF1R_FOVR1,	0x10	@ FIFO 1 Overrun
.equ	CAN_RF1R_RFOM1,	0x20	@ Release FIFO 1 Output Mailbox

@ Bit definition for CAN_IER register
.equ	CAN_IER_TMEIE,	0x00000001	@ Transmit Mailbox Empty Interrupt Enable
.equ	CAN_IER_FMPIE0,	0x00000002	@ FIFO Message Pending Interrupt Enable
.equ	CAN_IER_FFIE0,	0x00000004	@ FIFO Full Interrupt Enable
.equ	CAN_IER_FOVIE0,	0x00000008	@ FIFO Overrun Interrupt Enable
.equ	CAN_IER_FMPIE1,	0x00000010	@ FIFO Message Pending Interrupt Enable
.equ	CAN_IER_FFIE1,	0x00000020	@ FIFO Full Interrupt Enable
.equ	CAN_IER_FOVIE1,	0x00000040	@ FIFO Overrun Interrupt Enable
.equ	CAN_IER_EWGIE,	0x00000100	@ Error Warning Interrupt Enable
.equ	CAN_IER_EPVIE,	0x00000200	@ Error Passive Interrupt Enable
.equ	CAN_IER_BOFIE,	0x00000400	@ Bus-Off Interrupt Enable
.equ	CAN_IER_LECIE,	0x00000800	@ Last Error Code Interrupt Enable
.equ	CAN_IER_ERRIE,	0x00008000	@ Error Interrupt Enable
.equ	CAN_IER_WKUIE,	0x00010000	@ Wakeup Interrupt Enable
.equ	CAN_IER_SLKIE,	0x00020000	@ Sleep Interrupt Enable

@ Bit definition for CAN_ESR register
.equ	CAN_ESR_EWGF,	0x00000001	@ Error Warning Flag
.equ	CAN_ESR_EPVF,	0x00000002	@ Error Passive Flag
.equ	CAN_ESR_BOFF,	0x00000004	@ Bus-Off Flag

.equ	CAN_ESR_LEC,	0x00000070	@ LEC[2:0] bits (Last Error Code)
.equ	CAN_ESR_LEC_0,	0x00000010	@ Bit 0
.equ	CAN_ESR_LEC_1,	0x00000020	@ Bit 1
.equ	CAN_ESR_LEC_2,	0x00000040	@ Bit 2

.equ	CAN_ESR_TEC,	0x00FF0000	@ Least significant byte of the 9-bit Transmit Error Counter
.equ	CAN_ESR_REC,	0xFF000000	@ Receive Error Counter

@ Bit definition for CAN_BTR register
.equ	CAN_BTR_BRP,	0x000003FF	@ Baud Rate Prescaler
.equ	CAN_BTR_TS1,	0x000F0000	@ Time Segment 1
.equ	CAN_BTR_TS2,	0x00700000	@ Time Segment 2
.equ	CAN_BTR_SJW,	0x03000000	@ Resynchronization Jump Width
.equ	CAN_BTR_LBKM,	0x40000000	@ Loop Back Mode (Debug)
.equ	CAN_BTR_SILM,	0x80000000	@ Silent Mode

@ Mailbox registers
@ Bit definition for CAN_TI0R register
.equ	CAN_TI0R_TXRQ,	0x00000001	@ Transmit Mailbox Request
.equ	CAN_TI0R_RTR,	0x00000002	@ Remote Transmission Request
.equ	CAN_TI0R_IDE,	0x00000004	@ Identifier Extension
.equ	CAN_TI0R_EXID,	0x001FFFF8	@ Extended Identifier
.equ	CAN_TI0R_STID,	0xFFE00000	@ Standard Identifier or Extended Identifier

@ Bit definition for CAN_TDT0R register
.equ	CAN_TDT0R_DLC,	0x0000000F	@ Data Length Code
.equ	CAN_TDT0R_TGT,	0x00000100	@ Transmit Global Time
.equ	CAN_TDT0R_TIME,	0xFFFF0000	@ Message Time Stamp

@ Bit definition for CAN_TDL0R register
.equ	CAN_TDL0R_DATA0,	0x000000FF	@ Data byte 0
.equ	CAN_TDL0R_DATA1,	0x0000FF00	@ Data byte 1
.equ	CAN_TDL0R_DATA2,	0x00FF0000	@ Data byte 2
.equ	CAN_TDL0R_DATA3,	0xFF000000	@ Data byte 3

