seradya/Lab1_Asm/Lab1_HelloWorld/Core/Asm/stm32l1xx.s
@ Bit definition for CAN_TDH0R register
.equ	CAN_TDH0R_DATA4,	0x000000FF	@ Data byte 4
.equ	CAN_TDH0R_DATA5,	0x0000FF00	@ Data byte 5
.equ	CAN_TDH0R_DATA6,	0x00FF0000	@ Data byte 6
.equ	CAN_TDH0R_DATA7,	0xFF000000	@ Data byte 7

@ Bit definition for CAN_TI1R register
.equ	CAN_TI1R_TXRQ,	0x00000001	@ Transmit Mailbox Request
.equ	CAN_TI1R_RTR,	0x00000002	@ Remote Transmission Request
.equ	CAN_TI1R_IDE,	0x00000004	@ Identifier Extension
.equ	CAN_TI1R_EXID,	0x001FFFF8	@ Extended Identifier
.equ	CAN_TI1R_STID,	0xFFE00000	@ Standard Identifier or Extended Identifier

@ Bit definition for CAN_TDT1R register
.equ	CAN_TDT1R_DLC,	0x0000000F	@ Data Length Code
.equ	CAN_TDT1R_TGT,	0x00000100	@ Transmit Global Time
.equ	CAN_TDT1R_TIME,	0xFFFF0000	@ Message Time Stamp

@ Bit definition for CAN_TDL1R register
.equ	CAN_TDL1R_DATA0,	0x000000FF	@ Data byte 0
.equ	CAN_TDL1R_DATA1,	0x0000FF00	@ Data byte 1
.equ	CAN_TDL1R_DATA2,	0x00FF0000	@ Data byte 2
.equ	CAN_TDL1R_DATA3,	0xFF000000	@ Data byte 3

@ Bit definition for CAN_TDH1R register
.equ	CAN_TDH1R_DATA4,	0x000000FF	@ Data byte 4
.equ	CAN_TDH1R_DATA5,	0x0000FF00	@ Data byte 5
.equ	CAN_TDH1R_DATA6,	0x00FF0000	@ Data byte 6
.equ	CAN_TDH1R_DATA7,	0xFF000000	@ Data byte 7

@ Bit definition for CAN_TI2R register
.equ	CAN_TI2R_TXRQ,	0x00000001	@ Transmit Mailbox Request
.equ	CAN_TI2R_RTR,	0x00000002	@ Remote Transmission Request
.equ	CAN_TI2R_IDE,	0x00000004	@ Identifier Extension
.equ	CAN_TI2R_EXID,	0x001FFFF8	@ Extended identifier
.equ	CAN_TI2R_STID,	0xFFE00000	@ Standard Identifier or Extended Identifier

@ Bit definition for CAN_TDT2R register
.equ	CAN_TDT2R_DLC,	0x0000000F	@ Data Length Code
.equ	CAN_TDT2R_TGT,	0x00000100	@ Transmit Global Time
.equ	CAN_TDT2R_TIME,	0xFFFF0000	@ Message Time Stamp

@ Bit definition for CAN_TDL2R register
.equ	CAN_TDL2R_DATA0,	0x000000FF	@ Data byte 0
.equ	CAN_TDL2R_DATA1,	0x0000FF00	@ Data byte 1
.equ	CAN_TDL2R_DATA2,	0x00FF0000	@ Data byte 2
.equ	CAN_TDL2R_DATA3,	0xFF000000	@ Data byte 3

@ Bit definition for CAN_TDH2R register
.equ	CAN_TDH2R_DATA4,	0x000000FF	@ Data byte 4
.equ	CAN_TDH2R_DATA5,	0x0000FF00	@ Data byte 5
.equ	CAN_TDH2R_DATA6,	0x00FF0000	@ Data byte 6
.equ	CAN_TDH2R_DATA7,	0xFF000000	@ Data byte 7

@ Bit definition for CAN_RI0R register
.equ	CAN_RI0R_RTR,	0x00000002	@ Remote Transmission Request
.equ	CAN_RI0R_IDE,	0x00000004	@ Identifier Extension
.equ	CAN_RI0R_EXID,	0x001FFFF8	@ Extended Identifier
.equ	CAN_RI0R_STID,	0xFFE00000	@ Standard Identifier or Extended Identifier

@ Bit definition for CAN_RDT0R register
.equ	CAN_RDT0R_DLC,	0x0000000F	@ Data Length Code
.equ	CAN_RDT0R_FMI,	0x0000FF00	@ Filter Match Index
.equ	CAN_RDT0R_TIME,	0xFFFF0000	@ Message Time Stamp

@ Bit definition for CAN_RDL0R register
.equ	CAN_RDL0R_DATA0,	0x000000FF	@ Data byte 0
.equ	CAN_RDL0R_DATA1,	0x0000FF00	@ Data byte 1
.equ	CAN_RDL0R_DATA2,	0x00FF0000	@ Data byte 2
.equ	CAN_RDL0R_DATA3,	0xFF000000	@ Data byte 3

@ Bit definition for CAN_RDH0R register
.equ	CAN_RDH0R_DATA4,	0x000000FF	@ Data byte 4
.equ	CAN_RDH0R_DATA5,	0x0000FF00	@ Data byte 5
.equ	CAN_RDH0R_DATA6,	0x00FF0000	@ Data byte 6
.equ	CAN_RDH0R_DATA7,	0xFF000000	@ Data byte 7

@ Bit definition for CAN_RI1R register
.equ	CAN_RI1R_RTR,	0x00000002	@ Remote Transmission Request
.equ	CAN_RI1R_IDE,	0x00000004	@ Identifier Extension
.equ	CAN_RI1R_EXID,	0x001FFFF8	@ Extended identifier
.equ	CAN_RI1R_STID,	0xFFE00000	@ Standard Identifier or Extended Identifier

@ Bit definition for CAN_RDT1R register
.equ	CAN_RDT1R_DLC,	0x0000000F	@ Data Length Code
.equ	CAN_RDT1R_FMI,	0x0000FF00	@ Filter Match Index
.equ	CAN_RDT1R_TIME,	0xFFFF0000	@ Message Time Stamp

@ Bit definition for CAN_RDL1R register
.equ	CAN_RDL1R_DATA0,	0x000000FF	@ Data byte 0
.equ	CAN_RDL1R_DATA1,	0x0000FF00	@ Data byte 1
.equ	CAN_RDL1R_DATA2,	0x00FF0000	@ Data byte 2
.equ	CAN_RDL1R_DATA3,	0xFF000000	@ Data byte 3

@ Bit definition for CAN_RDH1R register
.equ	CAN_RDH1R_DATA4,	0x000000FF	@ Data byte 4
.equ	CAN_RDH1R_DATA5,	0x0000FF00	@ Data byte 5
.equ	CAN_RDH1R_DATA6,	0x00FF0000	@ Data byte 6
.equ	CAN_RDH1R_DATA7,	0xFF000000	@ Data byte 7

@ CAN filter registers
@ Bit definition for CAN_FMR register
.equ	CAN_FMR_FINIT,	0x01	@ Filter Init Mode

@ Bit definition for CAN_FM1R register
.equ	CAN_FM1R_FBM,	0x3FFF	@ Filter Mode
.equ	CAN_FM1R_FBM0,	0x0001	@ Filter Init Mode bit 0
.equ	CAN_FM1R_FBM1,	0x0002	@ Filter Init Mode bit 1
.equ	CAN_FM1R_FBM2,	0x0004	@ Filter Init Mode bit 2
.equ	CAN_FM1R_FBM3,	0x0008	@ Filter Init Mode bit 3
.equ	CAN_FM1R_FBM4,	0x0010	@ Filter Init Mode bit 4
.equ	CAN_FM1R_FBM5,	0x0020	@ Filter Init Mode bit 5
.equ	CAN_FM1R_FBM6,	0x0040	@ Filter Init Mode bit 6
.equ	CAN_FM1R_FBM7,	0x0080	@ Filter Init Mode bit 7
.equ	CAN_FM1R_FBM8,	0x0100	@ Filter Init Mode bit 8
.equ	CAN_FM1R_FBM9,	0x0200	@ Filter Init Mode bit 9
.equ	CAN_FM1R_FBM10,	0x0400	@ Filter Init Mode bit 10
.equ	CAN_FM1R_FBM11,	0x0800	@ Filter Init Mode bit 11
.equ	CAN_FM1R_FBM12,	0x1000	@ Filter Init Mode bit 12
.equ	CAN_FM1R_FBM13,	0x2000	@ Filter Init Mode bit 13

@ Bit definition for CAN_FS1R register
.equ	CAN_FS1R_FSC,	0x3FFF	@ Filter Scale Configuration
.equ	CAN_FS1R_FSC0,	0x0001	@ Filter Scale Configuration bit 0
.equ	CAN_FS1R_FSC1,	0x0002	@ Filter Scale Configuration bit 1
.equ	CAN_FS1R_FSC2,	0x0004	@ Filter Scale Configuration bit 2
.equ	CAN_FS1R_FSC3,	0x0008	@ Filter Scale Configuration bit 3
.equ	CAN_FS1R_FSC4,	0x0010	@ Filter Scale Configuration bit 4
.equ	CAN_FS1R_FSC5,	0x0020	@ Filter Scale Configuration bit 5
.equ	CAN_FS1R_FSC6,	0x0040	@ Filter Scale Configuration bit 6
.equ	CAN_FS1R_FSC7,	0x0080	@ Filter Scale Configuration bit 7
.equ	CAN_FS1R_FSC8,	0x0100	@ Filter Scale Configuration bit 8
.equ	CAN_FS1R_FSC9,	0x0200	@ Filter Scale Configuration bit 9
.equ	CAN_FS1R_FSC10,	0x0400	@ Filter Scale Configuration bit 10
.equ	CAN_FS1R_FSC11,	0x0800	@ Filter Scale Configuration bit 11
.equ	CAN_FS1R_FSC12,	0x1000	@ Filter Scale Configuration bit 12
.equ	CAN_FS1R_FSC13,	0x2000	@ Filter Scale Configuration bit 13

@ Bit definition for CAN_FFA1R register
.equ	CAN_FFA1R_FFA,	0x3FFF	@ Filter FIFO Assignment
.equ	CAN_FFA1R_FFA0,	0x0001	@ Filter FIFO Assignment for Filter 0
.equ	CAN_FFA1R_FFA1,	0x0002	@ Filter FIFO Assignment for Filter 1
.equ	CAN_FFA1R_FFA2,	0x0004	@ Filter FIFO Assignment for Filter 2
.equ	CAN_FFA1R_FFA3,	0x0008	@ Filter FIFO Assignment for Filter 3
.equ	CAN_FFA1R_FFA4,	0x0010	@ Filter FIFO Assignment for Filter 4
.equ	CAN_FFA1R_FFA5,	0x0020	@ Filter FIFO Assignment for Filter 5
.equ	CAN_FFA1R_FFA6,	0x0040	@ Filter FIFO Assignment for Filter 6
.equ	CAN_FFA1R_FFA7,	0x0080	@ Filter FIFO Assignment for Filter 7
.equ	CAN_FFA1R_FFA8,	0x0100	@ Filter FIFO Assignment for Filter 8
.equ	CAN_FFA1R_FFA9,	0x0200	@ Filter FIFO Assignment for Filter 9
.equ	CAN_FFA1R_FFA10,	0x0400	@ Filter FIFO Assignment for Filter 10
.equ	CAN_FFA1R_FFA11,	0x0800	@ Filter FIFO Assignment for Filter 11
.equ	CAN_FFA1R_FFA12,	0x1000	@ Filter FIFO Assignment for Filter 12
.equ	CAN_FFA1R_FFA13,	0x2000	@ Filter FIFO Assignment for Filter 13

@ Bit definition for CAN_FA1R register
.equ	CAN_FA1R_FACT,	0x3FFF	@ Filter Active
.equ	CAN_FA1R_FACT0,	0x0001	@ Filter 0 Active
.equ	CAN_FA1R_FACT1,	0x0002	@ Filter 1 Active
.equ	CAN_FA1R_FACT2,	0x0004	@ Filter 2 Active
.equ	CAN_FA1R_FACT3,	0x0008	@ Filter 3 Active
.equ	CAN_FA1R_FACT4,	0x0010	@ Filter 4 Active
.equ	CAN_FA1R_FACT5,	0x0020	@ Filter 5 Active
.equ	CAN_FA1R_FACT6,	0x0040	@ Filter 6 Active
.equ	CAN_FA1R_FACT7,	0x0080	@ Filter 7 Active
.equ	CAN_FA1R_FACT8,	0x0100	@ Filter 8 Active
.equ	CAN_FA1R_FACT9,	0x0200	@ Filter 9 Active
.equ	CAN_FA1R_FACT10,	0x0400	@ Filter 10 Active
.equ	CAN_FA1R_FACT11,	0x0800	@ Filter 11 Active
.equ	CAN_FA1R_FACT12,	0x1000	@ Filter 12 Active
.equ	CAN_FA1R_FACT13,	0x2000	@ Filter 13 Active

