seradya/Lab1_Asm/Lab1_HelloWorld/Core/Asm/stm32l1xx.s
@ Bit definition for SPI_SR register
.equ	SPI_SR_RXNE,	0x01	@ Receive buffer Not Empty
.equ	SPI_SR_TXE,	0x02	@ Transmit buffer Empty
.equ	SPI_SR_CHSIDE,	0x04	@ Channel side
.equ	SPI_SR_UDR,	0x08	@ Underrun flag
.equ	SPI_SR_CRCERR,	0x10	@ CRC Error flag
.equ	SPI_SR_MODF,	0x20	@ Mode fault
.equ	SPI_SR_OVR,	0x40	@ Overrun flag
.equ	SPI_SR_BSY,	0x80	@ Busy flag

@ Bit definition for SPI_DR register
.equ	SPI_DR_DR,	0xFFFF	@ Data Register

@ Bit definition for SPI_CRCPR register
.equ	SPI_CRCPR_CRCPOLY,	0xFFFF	@ CRC polynomial register

@ Bit definition for SPI_RXCRCR register
.equ	SPI_RXCRCR_RXCRC,	0xFFFF	@ Rx CRC Register

@ Bit definition for SPI_TXCRCR register
.equ	SPI_TXCRCR_TXCRC,	0xFFFF	@ Tx CRC Register

@ Bit definition for SPI_I2SCFGR register
.equ	SPI_I2SCFGR_CHLEN,	0x0001	@ Channel length (number of bits per audio channel)

.equ	SPI_I2SCFGR_DATLEN,	0x0006	@ DATLEN[1:0] bits (Data length to be transferred)
.equ	SPI_I2SCFGR_DATLEN_0,	0x0002	@ Bit 0
.equ	SPI_I2SCFGR_DATLEN_1,	0x0004	@ Bit 1

.equ	SPI_I2SCFGR_CKPOL,	0x0008	@ steady state clock polarity

.equ	SPI_I2SCFGR_I2SSTD,	0x0030	@ I2SSTD[1:0] bits (I2S standard selection)
.equ	SPI_I2SCFGR_I2SSTD_0,	0x0010	@ Bit 0
.equ	SPI_I2SCFGR_I2SSTD_1,	0x0020	@ Bit 1

.equ	SPI_I2SCFGR_PCMSYNC,	0x0080	@ PCM frame synchronization

.equ	SPI_I2SCFGR_I2SCFG,	0x0300	@ I2SCFG[1:0] bits (I2S configuration mode)
.equ	SPI_I2SCFGR_I2SCFG_0,	0x0100	@ Bit 0
.equ	SPI_I2SCFGR_I2SCFG_1,	0x0200	@ Bit 1

.equ	SPI_I2SCFGR_I2SE,	0x0400	@ I2S Enable
.equ	SPI_I2SCFGR_I2SMOD,	0x0800	@ I2S mode selection

@ Bit definition for SPI_I2SPR register
.equ	SPI_I2SPR_I2SDIV,	0x00FF	@ I2S Linear prescaler
.equ	SPI_I2SPR_ODD,	0x0100	@ Odd factor for the prescaler
.equ	SPI_I2SPR_MCKOE,	0x0200	@ Master Clock Output Enable


@
@ Inter-integrated Circuit Interface
@


@ Bit definition for I2C_CR1 register
.equ	I2C_CR1_PE,	0x0001	@ Peripheral Enable
.equ	I2C_CR1_SMBUS,	0x0002	@ SMBus Mode
.equ	I2C_CR1_SMBTYPE,	0x0008	@ SMBus Type
.equ	I2C_CR1_ENARP,	0x0010	@ ARP Enable
.equ	I2C_CR1_ENPEC,	0x0020	@ PEC Enable
.equ	I2C_CR1_ENGC,	0x0040	@ General Call Enable
.equ	I2C_CR1_NOSTRETCH,	0x0080	@ Clock Stretching Disable (Slave mode)
.equ	I2C_CR1_START,	0x0100	@ Start Generation
.equ	I2C_CR1_STOP,	0x0200	@ Stop Generation
.equ	I2C_CR1_ACK,	0x0400	@ Acknowledge Enable
.equ	I2C_CR1_POS,	0x0800	@ Acknowledge/PEC Position (for data reception)
.equ	I2C_CR1_PEC,	0x1000	@ Packet Error Checking
.equ	I2C_CR1_ALERT,	0x2000	@ SMBus Alert
.equ	I2C_CR1_SWRST,	0x8000	@ Software Reset

@ Bit definition for I2C_CR2 register
.equ	I2C_CR2_FREQ,	0x003F	@ FREQ[5:0] bits (Peripheral Clock Frequency)
.equ	I2C_CR2_FREQ_0,	0x0001	@ Bit 0
.equ	I2C_CR2_FREQ_1,	0x0002	@ Bit 1
.equ	I2C_CR2_FREQ_2,	0x0004	@ Bit 2
.equ	I2C_CR2_FREQ_3,	0x0008	@ Bit 3
.equ	I2C_CR2_FREQ_4,	0x0010	@ Bit 4
.equ	I2C_CR2_FREQ_5,	0x0020	@ Bit 5

.equ	I2C_CR2_ITERREN,	0x0100	@ Error Interrupt Enable
.equ	I2C_CR2_ITEVTEN,	0x0200	@ Event Interrupt Enable
.equ	I2C_CR2_ITBUFEN,	0x0400	@ Buffer Interrupt Enable
.equ	I2C_CR2_DMAEN,	0x0800	@ DMA Requests Enable
.equ	I2C_CR2_LAST,	0x1000	@ DMA Last Transfer

@ Bit definition for I2C_OAR1 register
.equ	I2C_OAR1_ADD1_7,	0x00FE	@ Interface Address
.equ	I2C_OAR1_ADD8_9,	0x0300	@ Interface Address

.equ	I2C_OAR1_ADD0,	0x0001	@ Bit 0
.equ	I2C_OAR1_ADD1,	0x0002	@ Bit 1
.equ	I2C_OAR1_ADD2,	0x0004	@ Bit 2
.equ	I2C_OAR1_ADD3,	0x0008	@ Bit 3
.equ	I2C_OAR1_ADD4,	0x0010	@ Bit 4
.equ	I2C_OAR1_ADD5,	0x0020	@ Bit 5
.equ	I2C_OAR1_ADD6,	0x0040	@ Bit 6
.equ	I2C_OAR1_ADD7,	0x0080	@ Bit 7
.equ	I2C_OAR1_ADD8,	0x0100	@ Bit 8
.equ	I2C_OAR1_ADD9,	0x0200	@ Bit 9

.equ	I2C_OAR1_ADDMODE,	0x8000	@ Addressing Mode (Slave mode)

@ Bit definition for I2C_OAR2 register
.equ	I2C_OAR2_ENDUAL,	0x01	@ Dual addressing mode enable
.equ	I2C_OAR2_ADD2,	0xFE	@ Interface address

@ Bit definition for I2C_DR register
.equ	I2C_DR_DR,	0xFF	@ 8-bit Data Register

@ Bit definition for I2C_SR1 register
.equ	I2C_SR1_SB,	0x0001	@ Start Bit (Master mode)
.equ	I2C_SR1_ADDR,	0x0002	@ Address sent (master mode)/matched (slave mode)
.equ	I2C_SR1_BTF,	0x0004	@ Byte Transfer Finished
.equ	I2C_SR1_ADD10,	0x0008	@ 10-bit header sent (Master mode)
.equ	I2C_SR1_STOPF,	0x0010	@ Stop detection (Slave mode)
.equ	I2C_SR1_RXNE,	0x0040	@ Data Register not Empty (receivers)
.equ	I2C_SR1_TXE,	0x0080	@ Data Register Empty (transmitters)
.equ	I2C_SR1_BERR,	0x0100	@ Bus Error
.equ	I2C_SR1_ARLO,	0x0200	@ Arbitration Lost (master mode)
.equ	I2C_SR1_AF,	0x0400	@ Acknowledge Failure
.equ	I2C_SR1_OVR,	0x0800	@ Overrun/Underrun
.equ	I2C_SR1_PECERR,	0x1000	@ PEC Error in reception
.equ	I2C_SR1_TIMEOUT,	0x4000	@ Timeout or Tlow Error
.equ	I2C_SR1_SMBALERT,	0x8000	@ SMBus Alert

@ Bit definition for I2C_SR2 register
.equ	I2C_SR2_MSL,	0x0001	@ Master/Slave
.equ	I2C_SR2_BUSY,	0x0002	@ Bus Busy
.equ	I2C_SR2_TRA,	0x0004	@ Transmitter/Receiver
.equ	I2C_SR2_GENCALL,	0x0010	@ General Call Address (Slave mode)
.equ	I2C_SR2_SMBDEFAULT,	0x0020	@ SMBus Device Default Address (Slave mode)
.equ	I2C_SR2_SMBHOST,	0x0040	@ SMBus Host Header (Slave mode)
.equ	I2C_SR2_DUALF,	0x0080	@ Dual Flag (Slave mode)
.equ	I2C_SR2_PEC,	0xFF00	@ Packet Error Checking Register

@ Bit definition for I2C_CCR register
.equ	I2C_CCR_CCR,	0x0FFF	@ Clock Control Register in Fast/Standard mode (Master mode)
.equ	I2C_CCR_DUTY,	0x4000	@ Fast Mode Duty Cycle
.equ	I2C_CCR_FS,	0x8000	@ I2C Master Mode Selection

@ Bit definition for I2C_TRISE register
.equ	I2C_TRISE_TRISE,	0x3F	@ Maximum Rise Time in Fast/Standard mode (Master mode)


@
@ Universal Synchronous Asynchronous Receiver Transmitter
@


@ Bit definition for USART_SR register
.equ	USART_SR_PE,	0x0001	@ Parity Error
.equ	USART_SR_FE,	0x0002	@ Framing Error
.equ	USART_SR_NE,	0x0004	@ Noise Error Flag
.equ	USART_SR_ORE,	0x0008	@ OverRun Error
.equ	USART_SR_IDLE,	0x0010	@ IDLE line detected
.equ	USART_SR_RXNE,	0x0020	@ Read Data Register Not Empty
.equ	USART_SR_TC,	0x0040	@ Transmission Complete
.equ	USART_SR_TXE,	0x0080	@ Transmit Data Register Empty
.equ	USART_SR_LBD,	0x0100	@ LIN Break Detection Flag
.equ	USART_SR_CTS,	0x0200	@ CTS Flag

@ Bit definition for USART_DR register
.equ	USART_DR_DR,	0x01FF	@ Data value

